export const responce = [
    {
        "crossing_count": 0,
        "id": "683094",
        "movements": [
            {
                "alternatives": [
                    {
                        "geometry": [
                            {
                                "selection": "LINESTRING(37.737450 55.709320, 37.737435 55.709326)",
                                "z_first": 0,
                                "z_last": 0
                            },
                            {
                                "selection": "LINESTRING(37.737435 55.709326, 37.737465 55.709414)",
                                "z_first": 0,
                                "z_last": 0
                            },
                            {
                                "selection": "LINESTRING(37.737465 55.709414, 37.738210 55.709332)",
                                "z_first": 0,
                                "z_last": 0
                            },
                            {
                                "selection": "LINESTRING(37.738210 55.709332, 37.738225 55.709393)",
                                "z_first": 0,
                                "z_last": 0
                            },
                            {
                                "selection": "LINESTRING(37.738225 55.709393, 37.739018 55.709397)",
                                "z_first": 0,
                                "z_last": 0
                            },
                            {
                                "selection": "LINESTRING(37.739018 55.709397, 37.740186 55.709289, 37.742299 55.709071)",
                                "z_first": 0,
                                "z_last": 0
                            },
                            {
                                "selection": "LINESTRING(37.742299 55.709071, 37.742422 55.709061, 37.742686 55.709061, 37.742740 55.709070, 37.742775 55.709086)",
                                "z_first": 0,
                                "z_last": 0
                            },
                            {
                                "selection": "LINESTRING(37.742775 55.709086, 37.743363 55.708923, 37.743789 55.709098, 37.744303 55.709310)",
                                "z_first": 0,
                                "z_last": 0
                            },
                            {
                                "selection": "LINESTRING(37.744303 55.709310, 37.744248 55.709339, 37.744205 55.709322)",
                                "z_first": 0,
                                "z_last": 0
                            }
                        ]
                    }
                ],
                "distance": 476,
                "id": "683095",
                "moving_duration": 342,
                "platforms": null,
                "routes": null,
                "type": "walkway",
                "waiting_duration": 0,
                "waypoint": {
                    "comment": "пешком 480 м",
                    "name": "Начальная точка",
                    "subtype": "start"
                }
            },
            {
                "distance": 0,
                "id": "683096",
                "moving_duration": 0,
                "type": "walkway",
                "waiting_duration": 0,
                "waypoint": {
                    "comment": "Вы на месте!",
                    "name": "Конечная точка",
                    "subtype": "finish"
                }
            }
        ],
        "pedestrian": true,
        "route_id": "moscow-ctx-back.m1/ctxrouting/17596081074462.71094",
        "total_distance": 476,
        "total_duration": 342,
        "total_walkway_distance": "пешком 480 м",
        "transfer_count": 0,
        "transport": [
            "pedestrian",
            "bus",
            "trolleybus",
            "tram",
            "shuttle_bus",
            "metro",
            "suburban_train",
            "funicular_railway",
            "monorail",
            "river_transport",
            "cable_car",
            "light_rail",
            "premetro",
            "light_metro",
            "aeroexpress",
            "mcd",
            "mcc"
        ]
    }
]

export const bigResponce =  {
    "points": [
      {
        "name": "метро Октябрьская",
        "latitude": 55.722847,
        "longitude": 37.674881,
        "point_type": "start",
        "description": null,
        "address": "1-я Дубровская улица, 13а ст1"
      },
      {
        "name": "парк на севере Москвы",
        "latitude": 55.89943,
        "longitude": 37.386676,
        "point_type": "end",
        "description": null,
        "address": "парк на севере Москвы"
      },
      {
        "name": "парк на севере Москвы",
        "latitude": 55.89943,
        "longitude": 37.386676,
        "point_type": "start",
        "description": null,
        "address": "парк на севере Москвы"
      },
      {
        "name": "ресторан/кафе рядом с парком",
        "latitude": 55.844946,
        "longitude": 37.01015,
        "point_type": "end",
        "description": null,
        "address": "ресторан/кафе рядом с парком"
      },
      {
        "name": "ресторан/кафе рядом с парком",
        "latitude": 55.844946,
        "longitude": 37.01015,
        "point_type": "start",
        "description": null,
        "address": "ресторан/кафе рядом с парком"
      },
      {
        "name": "метро Сокольники",
        "latitude": 55.722847,
        "longitude": 37.674881,
        "point_type": "end",
        "description": null,
        "address": "1-я Дубровская улица, 13а ст1"
      }
    ],
    "routes": null,
    "stages": [
      {
        "stage_id": "stage_1",
        "start_point": {
          "name": "метро Октябрьская",
          "latitude": 55.722847,
          "longitude": 37.674881,
          "point_type": "start",
          "description": null,
          "address": "1-я Дубровская улица, 13а ст1"
        },
        "end_point": {
          "name": "парк на севере Москвы",
          "latitude": 55.89943,
          "longitude": 37.386676,
          "point_type": "end",
          "description": null,
          "address": "парк на севере Москвы"
        },
        "waypoints": null,
        "transport_preference": "только трамвай",
        "route_preference": "fastest",
        "routes": [
          {
            "route_id": "public_transport_1",
            "total_distance": 32456,
            "total_duration": 4889,
            "transfer_count": 1,
            "transport_types": [],
            "segments": [],
            "summary": "⚠️ Маршрут public_transport_1: 81 мин, 32 км, 1 пересадок (альтернативный маршрут - запрошенный транспорт недоступен)",
            "raw_data": {
              "crossing_count": 1,
              "id": "155332",
              "movements": [
                {
                  "alternatives": [
                    {
                      "geometry": [
                        {
                          "selection": "LINESTRING(37.674881 55.722847, 37.675277 55.722360)",
                          "z_first": 0,
                          "z_last": 0
                        },
                        {
                          "selection": "LINESTRING(37.675277 55.722360, 37.676482 55.722670, 37.676531 55.722689, 37.676562 55.722712, 37.676568 55.722742, 37.676555 55.722777, 37.675843 55.723657)",
                          "z_first": 0,
                          "z_last": 0
                        },
                        {
                          "selection": "LINESTRING(37.675843 55.723657, 37.675707 55.723825, 37.675520 55.723777, 37.674933 55.723627, 37.674845 55.723604, 37.674592 55.723538, 37.674371 55.723481, 37.674091 55.723410, 37.673924 55.723313, 37.673812 55.723284, 37.673296 55.723151)",
                          "z_first": 0,
                          "z_last": 0
                        },
                        {
                          "selection": "LINESTRING(37.673296 55.723151, 37.673195 55.723125)",
                          "z_first": 0,
                          "z_last": 0
                        },
                        {
                          "selection": "LINESTRING(37.673195 55.723125, 37.672902 55.723237)",
                          "z_first": 0,
                          "z_last": 0
                        },
                        {
                          "selection": "LINESTRING(37.672902 55.723237, 37.672868 55.723280, 37.672709 55.723488, 37.672703 55.723498, 37.672175 55.724124, 37.672054 55.724210, 37.671539 55.724831, 37.671469 55.724991, 37.671081 55.725471)",
                          "z_first": 0,
                          "z_last": 0
                        },
                        {
                          "selection": "LINESTRING(37.671081 55.725471, 37.670824 55.725788, 37.670777 55.725847)",
                          "z_first": 0,
                          "z_last": 0
                        },
                        {
                          "selection": "LINESTRING(37.670777 55.725847, 37.670743 55.725897, 37.670710 55.725943, 37.670641 55.726022, 37.670447 55.726298, 37.670218 55.726623, 37.669882 55.727100, 37.669876 55.727111, 37.669829 55.727189, 37.669778 55.727275, 37.669762 55.727301, 37.669741 55.727338, 37.669586 55.727309, 37.669433 55.727280, 37.669300 55.727499, 37.668984 55.728010, 37.668953 55.728059, 37.668905 55.728138, 37.668857 55.728214, 37.668501 55.728824, 37.668474 55.728870, 37.668317 55.729138, 37.668270 55.729216, 37.668213 55.729307, 37.668113 55.729469, 37.668006 55.729643, 37.667904 55.729808, 37.667828 55.729932, 37.667079 55.730885)",
                          "z_first": 0,
                          "z_last": 0
                        },
                        {
                          "selection": "LINESTRING(37.667079 55.730885, 37.667175 55.730909)",
                          "z_first": 0,
                          "z_last": 0
                        },
                        {
                          "selection": "LINESTRING(37.667175 55.730909, 37.667658 55.731164, 37.668017 55.731350, 37.668006 55.731385, 37.667957 55.731533, 37.667895 55.731724, 37.667841 55.731864, 37.667768 55.731905)",
                          "z_first": 0,
                          "z_last": 0
                        },
                        {
                          "selection": "LINESTRING(37.667768 55.731905, 37.667631 55.731981)",
                          "z_first": 0,
                          "z_last": -1
                        },
                        {
                          "selection": "LINESTRING(37.667631 55.731981, 37.667564 55.732018)",
                          "z_first": -1,
                          "z_last": -1
                        },
                        {
                          "selection": "LINESTRING(37.667564 55.732018, 37.667508 55.731986, 37.667506 55.731850, 37.666172 55.731857, 37.665835 55.731858)",
                          "z_first": -1,
                          "z_last": -1
                        }
                      ]
                    }
                  ],
                  "distance": 1696,
                  "id": "155333",
                  "moving_duration": 1205,
                  "platforms": null,
                  "routes": null,
                  "type": "walkway",
                  "waiting_duration": 0,
                  "waypoint": {
                    "comment": "пешком 1,7 км",
                    "name": "метро Октябрьская",
                    "subtype": "start"
                  }
                },
                {
                  "alternatives": [
                    {
                      "geometry": [
                        {
                          "selection": "LINESTRING(37.665835 55.731859, 37.664108 55.731867, 37.662945 55.731957, 37.661838 55.732096, 37.660109 55.732482, 37.658941 55.733034, 37.658167 55.733717, 37.656758 55.735160, 37.652655 55.739820, 37.652131 55.740379, 37.652131 55.740379, 37.651883 55.740644, 37.650311 55.742306, 37.649488 55.742985, 37.635041 55.752786, 37.634450 55.753278, 37.634019 55.753749, 37.633733 55.754173, 37.633110 55.755636, 37.633110 55.755636, 37.632832 55.756292, 37.632650 55.756587, 37.632433 55.756822, 37.632188 55.757044, 37.630808 55.758121, 37.629531 55.758993, 37.629172 55.759200, 37.628787 55.759391, 37.627413 55.759937, 37.626099 55.760627, 37.626099 55.760627, 37.624342 55.761550, 37.622554 55.762442, 37.621999 55.762669, 37.621299 55.762848, 37.611166 55.765012, 37.610075 55.765226, 37.608943 55.765432, 37.607493 55.765611, 37.607493 55.765611, 37.605402 55.765868, 37.603685 55.765971, 37.602144 55.765915, 37.601277 55.765794, 37.599957 55.765503, 37.588847 55.761255, 37.587874 55.760958, 37.586609 55.760699, 37.585488 55.760569, 37.584197 55.760568, 37.582530 55.760679, 37.580484 55.760976, 37.579528 55.761139, 37.579528 55.761139, 37.577572 55.761470, 37.564586 55.763037, 37.564070 55.763143, 37.563647 55.763261, 37.563215 55.763442, 37.562849 55.763639, 37.562347 55.763982, 37.561459 55.764774, 37.561459 55.764774, 37.560733 55.765421, 37.559335 55.766831, 37.555147 55.770651, 37.554784 55.771020, 37.554479 55.771402, 37.554208 55.771855, 37.553831 55.772559, 37.553588 55.772822, 37.553318 55.773047, 37.552933 55.773220, 37.552462 55.773360, 37.551816 55.773457, 37.550957 55.773526, 37.549814 55.773575, 37.548960 55.773591, 37.548623 55.773609, 37.546732 55.773710, 37.546732 55.773710, 37.546285 55.773735, 37.546285 55.773735, 37.544869 55.773809, 37.543185 55.773899, 37.524414 55.777999, 37.523861 55.778109, 37.523485 55.778148, 37.523161 55.778124, 37.522873 55.778077, 37.519288 55.777435, 37.519288 55.777435, 37.517982 55.777201, 37.516599 55.777094, 37.514945 55.777120, 37.513139 55.777462, 37.511970 55.777953, 37.511056 55.778757, 37.510541 55.779459, 37.505977 55.785680, 37.504626 55.787102, 37.503036 55.788307, 37.501101 55.789558, 37.498915 55.790786, 37.493576 55.793525, 37.493576 55.793525, 37.480228 55.800463, 37.466009 55.807787, 37.464620 55.808503, 37.464620 55.808503, 37.461643 55.810036, 37.460615 55.810416, 37.459740 55.810670, 37.458489 55.810851, 37.457249 55.810850, 37.456629 55.810846, 37.455863 55.810877, 37.455076 55.810939, 37.443070 55.813052, 37.440606 55.813713, 37.438383 55.814722, 37.436892 55.815911, 37.436029 55.817954, 37.436029 55.817954, 37.435378 55.819741, 37.435307 55.820184, 37.435248 55.820748, 37.435277 55.821362, 37.435395 55.821943, 37.435548 55.822304, 37.436317 55.824218, 37.436973 55.826500, 37.436973 55.826500, 37.437246 55.827452, 37.437546 55.829576, 37.437578 55.830530, 37.437498 55.831511, 37.437368 55.832331, 37.437322 55.833255, 37.437386 55.834367, 37.438157 55.837932, 37.440065 55.847085, 37.440111 55.847594, 37.440069 55.848231, 37.439716 55.850523, 37.439716 55.850523, 37.439579 55.851415, 37.439236 55.852620, 37.436458 55.860677)"
                        }
                      ],
                      "platforms": [
                        {
                          "geometry": "POINT(37.436458 55.860677)",
                          "id": "155336"
                        },
                        {
                          "geometry": "POINT(37.439716 55.850523)",
                          "id": "155337"
                        },
                        {
                          "geometry": "POINT(37.436973 55.826500)",
                          "id": "155338"
                        },
                        {
                          "geometry": "POINT(37.464620 55.808503)",
                          "id": "155339"
                        },
                        {
                          "geometry": "POINT(37.493576 55.793525)",
                          "id": "155340"
                        },
                        {
                          "geometry": "POINT(37.519288 55.777435)",
                          "id": "155341"
                        },
                        {
                          "geometry": "POINT(37.546732 55.773710)",
                          "id": "155342"
                        },
                        {
                          "geometry": "POINT(37.561459 55.764774)",
                          "id": "155343"
                        },
                        {
                          "geometry": "POINT(37.579528 55.761139)",
                          "id": "155344"
                        },
                        {
                          "geometry": "POINT(37.607493 55.765611)",
                          "id": "155345"
                        },
                        {
                          "geometry": "POINT(37.626099 55.760627)",
                          "id": "155346"
                        },
                        {
                          "geometry": "POINT(37.633110 55.755636)",
                          "id": "155347"
                        },
                        {
                          "geometry": "POINT(37.652131 55.740379)",
                          "id": "155348"
                        },
                        {
                          "geometry": "POINT(37.665835 55.731859)",
                          "id": "155349"
                        },
                        {
                          "geometry": "POINT(37.436029 55.817954)",
                          "id": "155350"
                        }
                      ]
                    }
                  ],
                  "distance": 24102,
                  "id": "155334",
                  "metro": {
                    "boarding_parts_suggest": [
                      1
                    ],
                    "boarding_parts_suggest_5_wagons": [
                      1
                    ],
                    "color": "#ae0191",
                    "exit_comment": "ТПУ \"Планерная\", Планерная ул., ул. Вилиса Лациса, автобус до Перепечинского кладбища, автобус в аэропорт Шереметьево (SVO)",
                    "exit_entrance_number": "1",
                    "line_name": "Таганско-Краснопресненская линия",
                    "ui_direction_suggest": "в сторону станции «Планерная»",
                    "ui_station_count": "13 станций"
                  },
                  "moving_duration": 2100,
                  "platforms": {
                    "names": [
                      "Таганская",
                      "Китай-город",
                      "Кузнецкий Мост",
                      "Пушкинская",
                      "Баррикадная",
                      "Улица 1905 года",
                      "Беговая",
                      "Полежаевская",
                      "Октябрьское Поле",
                      "Щукинская",
                      "Спартак",
                      "Тушинская",
                      "Сходненская"
                    ],
                    "penultimate_stop": "Сходненская"
                  },
                  "routes": null,
                  "type": "passage",
                  "waiting_duration": 90,
                  "waypoint": {
                    "combined": false,
                    "comment": "",
                    "name": "Пролетарская",
                    "subtype": "metro"
                  }
                },
                {
                  "alternatives": [
                    {
                      "entrances": [
                        {
                          "color": "#ae0191",
                          "exit": true,
                          "exit_comment": "ТПУ \"Планерная\", Планерная ул., ул. Вилиса Лациса, автобус до Перепечинского кладбища, автобус в аэропорт Шереметьево (SVO)",
                          "geometry": "POINT(37.436057 55.861855)",
                          "metro_logo": "metro_moscow_7",
                          "name": "Планерная",
                          "number": "1",
                          "show_other_station": false
                        }
                      ],
                      "geometry": [
                        {
                          "selection": "LINESTRING(37.436458 55.860676, 37.436091 55.861753)",
                          "z_first": -1,
                          "z_last": -1
                        },
                        {
                          "selection": "LINESTRING(37.436091 55.861753, 37.436056 55.861854)",
                          "z_first": -1,
                          "z_last": 0
                        },
                        {
                          "selection": "LINESTRING(37.436056 55.861854, 37.436132 55.861917, 37.436049 55.862165, 37.436285 55.862190, 37.436276 55.862286, 37.436237 55.862401, 37.436213 55.862399, 37.436024 55.862379, 37.435874 55.862819, 37.435814 55.862994)",
                          "z_first": 0,
                          "z_last": 0
                        },
                        {
                          "selection": "LINESTRING(37.435814 55.862994, 37.435846 55.862998)",
                          "z_first": 0,
                          "z_last": 0
                        }
                      ]
                    }
                  ],
                  "distance": 288,
                  "id": "155366",
                  "moving_duration": 184,
                  "platforms": null,
                  "routes": null,
                  "type": "crossing",
                  "waiting_duration": 0,
                  "waypoint": {
                    "comment": "пешком 290 м",
                    "name": "Планерная",
                    "subtype": "pedestrian"
                  }
                },
                {
                  "alternatives": [
                    {
                      "geometry": [
                        {
                          "selection": "LINESTRING(37.435846 55.862998, 37.435678 55.863488, 37.435678 55.863488, 37.435721 55.863521, 37.435829 55.863623, 37.435901 55.863734, 37.435901 55.863734, 37.435913 55.863753, 37.435913 55.863753, 37.435928 55.863776, 37.435928 55.863776, 37.436102 55.864045, 37.437020 55.865392, 37.437020 55.865392, 37.437207 55.865666, 37.437207 55.865666, 37.437331 55.865848, 37.437331 55.865848, 37.437360 55.865890, 37.437360 55.865890, 37.439735 55.869373, 37.439735 55.869373, 37.441110 55.871390, 37.441110 55.871390, 37.441174 55.871484, 37.441174 55.871484, 37.441091 55.871537, 37.441091 55.871537, 37.437289 55.873943, 37.436767 55.874175, 37.436300 55.874358, 37.435788 55.874501, 37.435788 55.874501, 37.435676 55.874532, 37.434992 55.874683, 37.434315 55.874837, 37.433646 55.875009, 37.431398 55.875728, 37.431398 55.875728, 37.431197 55.875792, 37.431197 55.875792, 37.430806 55.875913, 37.430806 55.875913, 37.429474 55.876326, 37.429474 55.876326, 37.429150 55.876427, 37.429150 55.876427, 37.428456 55.876642, 37.427652 55.876900, 37.427652 55.876900, 37.426126 55.877399, 37.426126 55.877399, 37.424177 55.878017, 37.424177 55.878017, 37.423481 55.878258, 37.423047 55.878471, 37.422779 55.878627, 37.422469 55.878815, 37.422050 55.879079, 37.421972 55.879131, 37.421972 55.879131, 37.421716 55.879300, 37.421217 55.879645, 37.420565 55.880067, 37.420565 55.880067, 37.419790 55.880564, 37.419460 55.880767, 37.419460 55.880767, 37.419249 55.880905, 37.419249 55.880905, 37.415770 55.883167, 37.415770 55.883167, 37.415255 55.883503, 37.415053 55.883615, 37.414871 55.883701, 37.414679 55.883776, 37.414479 55.883837, 37.414246 55.883885, 37.413985 55.883926, 37.413679 55.883961, 37.413679 55.883961, 37.413317 55.884001, 37.412334 55.884126, 37.411749 55.884222, 37.411749 55.884222, 37.411714 55.884228, 37.411597 55.884256, 37.411597 55.884256, 37.411287 55.884332, 37.411166 55.884370, 37.411166 55.884370, 37.411021 55.884416, 37.411021 55.884416, 37.409670 55.884839, 37.409108 55.885013, 37.409108 55.885013, 37.407320 55.885568, 37.407320 55.885568, 37.407280 55.885581, 37.407280 55.885581, 37.407139 55.885617, 37.406441 55.885812, 37.405990 55.885954, 37.405746 55.886037, 37.405415 55.886173, 37.405156 55.886283, 37.404953 55.886359, 37.404747 55.886417, 37.404412 55.886496, 37.403727 55.886659, 37.402647 55.887046, 37.402647 55.887046, 37.399719 55.888088, 37.399719 55.888088, 37.399420 55.888194, 37.399239 55.888244, 37.399005 55.888278, 37.399005 55.888278, 37.398564 55.888329, 37.398564 55.888329, 37.393862 55.888866, 37.393862 55.888866, 37.393392 55.888920, 37.393392 55.888920, 37.392665 55.889003, 37.392665 55.889003, 37.387227 55.889625, 37.386969 55.889667, 37.386729 55.889720, 37.386441 55.889822, 37.386227 55.889934, 37.386055 55.890061, 37.385908 55.890219, 37.385820 55.890350, 37.385712 55.890756, 37.385712 55.890756, 37.385701 55.890797, 37.385647 55.891110, 37.385627 55.891214, 37.385609 55.891373, 37.385615 55.891498, 37.385635 55.891598, 37.385823 55.892006, 37.385840 55.892030, 37.385840 55.892030, 37.386185 55.892564, 37.386185 55.892564, 37.386592 55.893193, 37.386678 55.893305, 37.386736 55.893368, 37.386736 55.893368, 37.387035 55.893693, 37.387125 55.893816, 37.388500 55.896088, 37.388587 55.896259, 37.388644 55.896419, 37.388697 55.896616, 37.388740 55.897168, 37.388740 55.897168, 37.388781 55.897690, 37.388755 55.897809, 37.388702 55.897926, 37.388702 55.897926, 37.388629 55.898057, 37.388520 55.898210, 37.388520 55.898210, 37.387383 55.899808)"
                        }
                      ],
                      "platforms": [
                        {
                          "geometry": "POINT(37.437020 55.865392)",
                          "id": "155369"
                        },
                        {
                          "geometry": "POINT(37.439735 55.869373)",
                          "id": "155370"
                        },
                        {
                          "geometry": "POINT(37.435788 55.874501)",
                          "id": "155371"
                        },
                        {
                          "geometry": "POINT(37.421972 55.879131)",
                          "id": "155372"
                        },
                        {
                          "geometry": "POINT(37.415770 55.883167)",
                          "id": "155373"
                        },
                        {
                          "geometry": "POINT(37.413679 55.883961)",
                          "id": "155374"
                        },
                        {
                          "geometry": "POINT(37.402647 55.887046)",
                          "id": "155375"
                        },
                        {
                          "geometry": "POINT(37.398564 55.888329)",
                          "id": "155376"
                        },
                        {
                          "geometry": "POINT(37.392665 55.889003)",
                          "id": "155377"
                        },
                        {
                          "geometry": "POINT(37.385712 55.890756)",
                          "id": "155378"
                        },
                        {
                          "geometry": "POINT(37.386185 55.892564)",
                          "id": "155379"
                        },
                        {
                          "geometry": "POINT(37.419249 55.880905)",
                          "id": "155380"
                        },
                        {
                          "geometry": "POINT(37.387383 55.899808)",
                          "id": "155381"
                        },
                        {
                          "geometry": "POINT(37.407320 55.885568)",
                          "id": "155382"
                        },
                        {
                          "geometry": "POINT(37.435846 55.862998)",
                          "id": "155383"
                        },
                        {
                          "geometry": "POINT(37.388740 55.897168)",
                          "id": "155384"
                        }
                      ]
                    }
                  ],
                  "distance": 6275,
                  "id": "155367",
                  "moving_duration": 1200,
                  "platforms": {
                    "names": [
                      "Детская поликлиника",
                      "Метродепо Планерное",
                      "Бутаковский залив",
                      "2-й Б микрорайон Химок",
                      "Аптека",
                      "Больница",
                      "Хирургическая больница",
                      "МФЦ Куркино",
                      "14-й микрорайон Куркина",
                      "9-й микрорайон Куркина",
                      "8-й микрорайон Куркина",
                      "7-й микрорайон Куркина",
                      "6-й микрорайон Куркина",
                      "Соколово-Мещерская д.14"
                    ]
                  },
                  "routes": [
                    {
                      "color": "#1a73f0",
                      "names": [
                        "362"
                      ],
                      "subtype": "bus",
                      "subtype_name": "автобус"
                    }
                  ],
                  "type": "passage",
                  "waiting_duration": 12,
                  "waypoint": {
                    "combined": false,
                    "comment": "",
                    "name": "Метро Планерная · 1F",
                    "subtype": "bus"
                  }
                },
                {
                  "alternatives": [
                    {
                      "geometry": [
                        {
                          "selection": "LINESTRING(37.387383 55.899808, 37.387368 55.899805)",
                          "z_first": 0,
                          "z_last": 0
                        },
                        {
                          "selection": "LINESTRING(37.387368 55.899805, 37.387452 55.899687, 37.387333 55.899660, 37.387448 55.899498)",
                          "z_first": 0,
                          "z_last": 0
                        },
                        {
                          "selection": "LINESTRING(37.387448 55.899498, 37.387353 55.899477, 37.387080 55.899415)",
                          "z_first": 0,
                          "z_last": 0
                        },
                        {
                          "selection": "LINESTRING(37.387080 55.899415, 37.387017 55.899401)",
                          "z_first": 0,
                          "z_last": 0
                        },
                        {
                          "selection": "LINESTRING(37.387017 55.899401, 37.386888 55.899372, 37.386833 55.899448)",
                          "z_first": 0,
                          "z_last": 0
                        },
                        {
                          "selection": "LINESTRING(37.386833 55.899448, 37.386676 55.899430)",
                          "z_first": 0,
                          "z_last": 0
                        }
                      ]
                    }
                  ],
                  "distance": 95,
                  "id": "155401",
                  "moving_duration": 98,
                  "platforms": null,
                  "routes": null,
                  "type": "walkway",
                  "waiting_duration": 0,
                  "waypoint": {
                    "comment": "пешком 95 м",
                    "name": "ОВД Куркино",
                    "subtype": "pedestrian"
                  }
                },
                {
                  "distance": 0,
                  "id": "155402",
                  "moving_duration": 0,
                  "type": "walkway",
                  "waiting_duration": 0,
                  "waypoint": {
                    "comment": "Вы на месте в 01:28.",
                    "name": "парк на севере Москвы",
                    "subtype": "finish"
                  }
                }
              ],
              "pedestrian": false,
              "route_id": "moscow-ctx-back.m9/ctxrouting/17596120292945.48828",
              "schedules": [
                {
                  "period": 3,
                  "precise_time": "",
                  "start_time": 1814,
                  "start_time_utc": 1759613414,
                  "type": "periodic"
                }
              ],
              "total_distance": 32456,
              "total_duration": 4889,
              "total_walkway_distance": "пешком 24 мин",
              "transfer_count": 1,
              "transport": [
                "pedestrian",
                "bus",
                "trolleybus",
                "tram",
                "shuttle_bus",
                "metro",
                "suburban_train",
                "funicular_railway",
                "monorail",
                "river_transport",
                "cable_car",
                "light_rail",
                "premetro",
                "light_metro",
                "aeroexpress",
                "mcd",
                "mcc"
              ],
              "waypoints": [
                {
                  "combined": false,
                  "routes_names": [
                    "Таганско-Краснопресненская линия"
                  ],
                  "subtype": "metro"
                },
                {
                  "combined": false,
                  "routes_names": [
                    "362"
                  ],
                  "subtype": "bus"
                }
              ]
            }
          }
        ],
        "description": "Первый этап на трамвае до парка"
      },
      {
        "stage_id": "stage_2",
        "start_point": {
          "name": "парк на севере Москвы",
          "latitude": 55.89943,
          "longitude": 37.386676,
          "point_type": "start",
          "description": null,
          "address": "парк на севере Москвы"
        },
        "end_point": {
          "name": "ресторан/кафе рядом с парком",
          "latitude": 55.844946,
          "longitude": 37.01015,
          "point_type": "end",
          "description": null,
          "address": "ресторан/кафе рядом с парком"
        },
        "waypoints": null,
        "transport_preference": "any",
        "route_preference": "fastest",
        "routes": [
          {
            "route_id": "taxi_1",
            "total_distance": 44164,
            "total_duration": 1967,
            "transfer_count": 0,
            "transport_types": [
              "taxi"
            ],
            "segments": [],
            "summary": "Маршрут taxi: 32 мин, 44 км",
            "raw_data": {
              "algorithm": "учтём выделенные полосы и пробки",
              "begin_pedestrian_path": {
                "geometry": {
                  "selection": "LINESTRING(37.386675 55.899430, 37.387444 55.899601)"
                }
              },
              "end_pedestrian_path": {
                "geometry": {
                  "selection": "LINESTRING(37.010302 55.844646, 37.010149 55.844946)"
                }
              },
              "filter_road_types": [
                "highway"
              ],
              "id": "10233856376748505685",
              "maneuvers": [
                {
                  "comment": "start",
                  "icon": "start",
                  "id": "3807188240184197299",
                  "outcoming_path": {
                    "distance": 186,
                    "duration": 23,
                    "geometry": [
                      {
                        "color": "fast",
                        "length": 186,
                        "selection": "LINESTRING(37.387444 55.899601, 37.387507 55.899511, 37.387787 55.899118, 37.388134 55.898630, 37.388395 55.898263, 37.388553 55.898043)",
                        "style": "normal"
                      }
                    ],
                    "names": [
                      "Соколово-Мещерская"
                    ]
                  },
                  "outcoming_path_comment": "200 м прямо",
                  "type": "begin"
                },
                {
                  "comment": "Поворот налево на ул. Юровская",
                  "icon": "crossroad_left",
                  "id": "12373014901661404080",
                  "outcoming_path": {
                    "distance": 654,
                    "duration": 94,
                    "geometry": [
                      {
                        "color": "fast",
                        "length": 654,
                        "selection": "LINESTRING(37.388553 55.898043, 37.388794 55.898048, 37.389189 55.898057, 37.389690 55.898068, 37.390045 55.898076, 37.390977 55.898096, 37.391005 55.898097, 37.391277 55.898103, 37.391372 55.898105, 37.391744 55.898113, 37.392688 55.898135, 37.392879 55.898139, 37.393013 55.898142, 37.393371 55.898149, 37.394408 55.898172, 37.394661 55.898178, 37.395173 55.898189, 37.395716 55.898201, 37.396374 55.898216, 37.396418 55.898217, 37.396669 55.898223, 37.397044 55.898231, 37.397115 55.898232, 37.397199 55.898234, 37.397502 55.898241, 37.398076 55.898253, 37.398204 55.898256, 37.398814 55.898258, 37.399161 55.898260, 37.399191 55.898260, 37.399237 55.898260)",
                        "style": "normal"
                      }
                    ],
                    "names": [
                      "Юровская"
                    ]
                  },
                  "outcoming_path_comment": "700 м прямо",
                  "turn_angle": -70,
                  "turn_direction": "left",
                  "type": "crossroad"
                },
                {
                  "comment": "Держитесь правее на ул. Новокуркинское шоссе",
                  "icon": "crossroad_keep_right",
                  "id": "4057022054509051947",
                  "outcoming_path": {
                    "distance": 2928,
                    "duration": 182,
                    "geometry": [
                      {
                        "color": "fast",
                        "length": 461,
                        "selection": "LINESTRING(37.399237 55.898260, 37.399281 55.898252, 37.399358 55.898239, 37.399423 55.898224, 37.399482 55.898205, 37.399535 55.898178, 37.399607 55.898140, 37.399624 55.898113, 37.399632 55.898100, 37.400049 55.897406, 37.400579 55.896526, 37.400605 55.896483, 37.400708 55.896312, 37.400874 55.896037, 37.401205 55.895486, 37.401240 55.895428, 37.401488 55.895016, 37.401808 55.894491, 37.401867 55.894408)",
                        "style": "normal"
                      },
                      {
                        "color": "normal",
                        "length": 5,
                        "selection": "LINESTRING(37.401867 55.894408, 37.401902 55.894360)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 296,
                        "selection": "LINESTRING(37.401902 55.894360, 37.401921 55.894332, 37.401937 55.894310, 37.401965 55.894275, 37.402318 55.893842, 37.402440 55.893695, 37.403113 55.892879, 37.403451 55.892470, 37.403466 55.892449, 37.403603 55.892258, 37.403701 55.892091, 37.403779 55.891922, 37.403794 55.891882)",
                        "style": "normal"
                      },
                      {
                        "color": "normal",
                        "length": 150,
                        "selection": "LINESTRING(37.403794 55.891882, 37.403856 55.891718, 37.403889 55.891597, 37.403916 55.891492, 37.403943 55.891332, 37.403945 55.891206, 37.403954 55.890804, 37.403929 55.890621, 37.403915 55.890519)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 399,
                        "selection": "LINESTRING(37.403915 55.890519, 37.403862 55.890133, 37.403813 55.889781, 37.403746 55.889291, 37.403685 55.888851, 37.403636 55.888425, 37.403630 55.888222, 37.403647 55.888061, 37.403666 55.887909, 37.403718 55.887743, 37.403807 55.887531, 37.403977 55.887246, 37.404128 55.887022, 37.404164 55.886969)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 419,
                        "selection": "LINESTRING(37.404164 55.886969, 37.404309 55.886752, 37.404433 55.886527, 37.404513 55.886340, 37.404564 55.886163, 37.404602 55.885973, 37.404728 55.885138, 37.404795 55.884849, 37.404884 55.884610, 37.404960 55.884439, 37.405087 55.884205, 37.405567 55.883363, 37.405592 55.883309)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 1198,
                        "selection": "LINESTRING(37.405592 55.883309, 37.405691 55.883105, 37.405779 55.882878, 37.405831 55.882694, 37.405858 55.882467, 37.405856 55.882236, 37.405834 55.882051, 37.405804 55.881925, 37.405731 55.881685, 37.405653 55.881481, 37.405586 55.881319, 37.405512 55.881130, 37.405423 55.880897, 37.405309 55.880616, 37.404318 55.877917, 37.404288 55.877836, 37.404213 55.877602, 37.404169 55.877342, 37.404158 55.877158, 37.404176 55.876988, 37.404216 55.876804, 37.404297 55.876614, 37.404394 55.876433, 37.404524 55.876263, 37.404668 55.876112, 37.404820 55.875967, 37.405024 55.875799, 37.405099 55.875746, 37.405198 55.875675, 37.405846 55.875224, 37.407018 55.874410, 37.407763 55.873895, 37.408122 55.873647, 37.408467 55.873406)",
                        "style": "normal"
                      }
                    ],
                    "names": [
                      "Новокуркинское шоссе"
                    ]
                  },
                  "outcoming_path_comment": "2.9 км прямо",
                  "turn_angle": 22,
                  "turn_direction": "keep_right",
                  "type": "crossroad"
                },
                {
                  "comment": "Держитесь правее на ул. МКАД",
                  "icon": "crossroad_keep_right",
                  "id": "5776972216642908972",
                  "outcoming_path": {
                    "distance": 648,
                    "duration": 35,
                    "geometry": [
                      {
                        "color": "fast",
                        "length": 648,
                        "selection": "LINESTRING(37.408467 55.873406, 37.408721 55.873121, 37.408979 55.872880, 37.409165 55.872717, 37.409354 55.872574, 37.409636 55.872379, 37.410503 55.871772, 37.410673 55.871634, 37.410757 55.871539, 37.410828 55.871439, 37.410879 55.871340, 37.410905 55.871252, 37.410921 55.871133, 37.410901 55.871005, 37.410857 55.870887, 37.410799 55.870786, 37.410712 55.870689, 37.410578 55.870586, 37.410441 55.870507, 37.410242 55.870396, 37.409544 55.870033, 37.408944 55.869721, 37.408087 55.869241, 37.407350 55.868800)",
                        "style": "normal"
                      }
                    ],
                    "names": [
                      "МКАД"
                    ]
                  },
                  "outcoming_path_comment": "600 м прямо",
                  "turn_angle": 13,
                  "turn_direction": "keep_right",
                  "type": "crossroad"
                },
                {
                  "comment": "Держитесь левее на ул. МКАД",
                  "icon": "crossroad_keep_left",
                  "id": "1320623866774626125",
                  "outcoming_path": {
                    "distance": 8688,
                    "duration": 320,
                    "geometry": [
                      {
                        "color": "fast",
                        "length": 4111,
                        "selection": "LINESTRING(37.407350 55.868800, 37.406998 55.868516, 37.406779 55.868323, 37.406566 55.868093, 37.406405 55.867876, 37.405873 55.867526, 37.404988 55.866878, 37.403963 55.866077, 37.402990 55.865315, 37.402112 55.864533, 37.401349 55.863819, 37.400595 55.863053, 37.400357 55.862781, 37.399122 55.861351, 37.398535 55.860602, 37.397928 55.859779, 37.397502 55.859018, 37.396073 55.856469, 37.395643 55.855702, 37.394972 55.854463, 37.393760 55.852226, 37.393166 55.851130, 37.392573 55.850033, 37.392311 55.849549, 37.391939 55.848654, 37.391721 55.847787, 37.391648 55.847265, 37.391656 55.846609, 37.391742 55.845981, 37.391914 55.845300, 37.392150 55.844684, 37.392488 55.844020, 37.392770 55.843583, 37.392892 55.843394, 37.393082 55.843141, 37.393104 55.843112, 37.393659 55.842370, 37.394065 55.841715, 37.394234 55.841443, 37.394495 55.840942, 37.394767 55.840416, 37.394997 55.839894, 37.395214 55.839305, 37.395306 55.839032, 37.395406 55.838737, 37.395566 55.838167, 37.395680 55.837621, 37.395761 55.837052, 37.395826 55.836330, 37.395852 55.835651, 37.395822 55.835034, 37.395817 55.834986, 37.395771 55.834507, 37.395697 55.834125)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 221,
                        "selection": "LINESTRING(37.395697 55.834125, 37.395567 55.833457, 37.395419 55.832942, 37.395175 55.832147)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 213,
                        "selection": "LINESTRING(37.395175 55.832147, 37.395036 55.831697, 37.394923 55.831355, 37.394632 55.830483, 37.394553 55.830246)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 187,
                        "selection": "LINESTRING(37.394553 55.830246, 37.394002 55.828587)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 3956,
                        "selection": "LINESTRING(37.394002 55.828587, 37.393908 55.828303, 37.393716 55.827641, 37.393658 55.827441, 37.393492 55.826784, 37.393485 55.826747, 37.393351 55.826009, 37.393087 55.824557, 37.393006 55.824100, 37.392781 55.823403, 37.392467 55.822426, 37.392194 55.821578, 37.392142 55.821419, 37.391796 55.820296, 37.390830 55.817165, 37.390489 55.816062, 37.389869 55.814051, 37.389717 55.813560, 37.389381 55.812472, 37.389277 55.812133, 37.388643 55.810077, 37.388308 55.808991, 37.388252 55.808808, 37.387992 55.808109, 37.387806 55.807607, 37.387767 55.807521, 37.387750 55.807484, 37.387681 55.807330, 37.387353 55.806602, 37.387257 55.806387, 37.387141 55.806163, 37.386852 55.805607, 37.386672 55.805308, 37.386647 55.805270, 37.386215 55.804559, 37.385846 55.804004, 37.385453 55.803414, 37.384649 55.802333, 37.384517 55.802169, 37.384199 55.801774, 37.384017 55.801578, 37.383119 55.800617, 37.380974 55.798385, 37.378866 55.796192, 37.378339 55.795643, 37.377276 55.794537)",
                        "style": "normal"
                      }
                    ],
                    "names": [
                      "МКАД"
                    ]
                  },
                  "outcoming_path_comment": "8.7 км прямо",
                  "turn_angle": -8,
                  "turn_direction": "keep_left",
                  "type": "crossroad"
                },
                {
                  "comment": "Держитесь правее на ул. Новорижское шоссе",
                  "icon": "crossroad_keep_right",
                  "id": "12397525856093083215",
                  "outcoming_path": {
                    "distance": 281,
                    "duration": 15,
                    "geometry": [
                      {
                        "color": "fast",
                        "length": 281,
                        "selection": "LINESTRING(37.377276 55.794537, 37.376992 55.794301, 37.376690 55.794052, 37.375992 55.793495, 37.375727 55.793273, 37.375484 55.793054, 37.374787 55.792425)",
                        "style": "normal"
                      }
                    ],
                    "names": [
                      "Новорижское шоссе"
                    ]
                  },
                  "outcoming_path_comment": "300 м прямо",
                  "turn_angle": 6,
                  "turn_direction": "keep_right",
                  "type": "crossroad"
                },
                {
                  "comment": "Держитесь правее на ул. Новорижское шоссе",
                  "icon": "crossroad_keep_right",
                  "id": "5306977193471368991",
                  "outcoming_path": {
                    "distance": 26763,
                    "duration": 914,
                    "geometry": [
                      {
                        "color": "fast",
                        "length": 96,
                        "selection": "LINESTRING(37.374787 55.792425, 37.374614 55.792287, 37.374352 55.792106, 37.374340 55.792098, 37.374172 55.791991, 37.373999 55.791888, 37.373760 55.791774)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 174,
                        "selection": "LINESTRING(37.373760 55.791774, 37.373517 55.791678, 37.373278 55.791598, 37.373025 55.791526, 37.372772 55.791469, 37.371228 55.791152)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 2411,
                        "selection": "LINESTRING(37.371228 55.791152, 37.369932 55.790885, 37.369659 55.790835, 37.369391 55.790799, 37.369166 55.790778, 37.368954 55.790769, 37.368721 55.790769, 37.368401 55.790781, 37.368089 55.790805, 37.368036 55.790809, 37.367532 55.790860, 37.366959 55.790972, 37.366039 55.791163, 37.364915 55.791397, 37.364295 55.791528, 37.362810 55.791843, 37.362239 55.791963, 37.361418 55.792154, 37.360652 55.792348, 37.359896 55.792566, 37.359140 55.792805, 37.358385 55.793061, 37.357762 55.793273, 37.357190 55.793469, 37.356698 55.793636, 37.356316 55.793778, 37.355929 55.793922, 37.355222 55.794207, 37.354556 55.794497, 37.354160 55.794675, 37.352954 55.795214, 37.351752 55.795752, 37.350838 55.796158, 37.349870 55.796577, 37.348965 55.796959, 37.348955 55.796963, 37.348254 55.797252, 37.347668 55.797484, 37.347099 55.797703, 37.346396 55.797953, 37.345713 55.798168, 37.345070 55.798357, 37.344441 55.798529, 37.343745 55.798702, 37.343418 55.798779, 37.343051 55.798865, 37.342240 55.799035, 37.341399 55.799201, 37.340556 55.799345, 37.339627 55.799483, 37.338662 55.799610, 37.337065 55.799803)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 348,
                        "selection": "LINESTRING(37.337065 55.799803, 37.336841 55.799830, 37.331898 55.800392, 37.331624 55.800422)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 554,
                        "selection": "LINESTRING(37.331624 55.800422, 37.331371 55.800449, 37.331172 55.800471, 37.330675 55.800524, 37.330609 55.800532, 37.329302 55.800677, 37.327968 55.800825, 37.326703 55.800991, 37.325757 55.801127, 37.324643 55.801311, 37.323573 55.801499, 37.323003 55.801609)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 71,
                        "selection": "LINESTRING(37.323003 55.801609, 37.322442 55.801717, 37.321930 55.801817)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 262,
                        "selection": "LINESTRING(37.321930 55.801817, 37.321251 55.801949, 37.319695 55.802292, 37.318561 55.802545, 37.318168 55.802633, 37.318018 55.802667)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 79,
                        "selection": "LINESTRING(37.318018 55.802667, 37.316833 55.802933)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 585,
                        "selection": "LINESTRING(37.316833 55.802933, 37.316039 55.803107, 37.315167 55.803281, 37.314213 55.803456, 37.313409 55.803587, 37.312647 55.803696, 37.311860 55.803790, 37.311057 55.803866, 37.309833 55.803960, 37.309339 55.803992, 37.308354 55.804044, 37.307735 55.804064)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 258,
                        "selection": "LINESTRING(37.307735 55.804064, 37.307221 55.804082, 37.303618 55.804103)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 871,
                        "selection": "LINESTRING(37.303618 55.804103, 37.302867 55.804108, 37.301175 55.804092, 37.300103 55.804052, 37.300072 55.804051, 37.299020 55.803986, 37.298100 55.803906, 37.297231 55.803814, 37.296995 55.803784, 37.296467 55.803717, 37.295767 55.803613, 37.295008 55.803481, 37.294251 55.803334, 37.293609 55.803203, 37.292898 55.803047, 37.292359 55.802921, 37.292212 55.802887, 37.291244 55.802656, 37.290161 55.802398)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 43,
                        "selection": "LINESTRING(37.290161 55.802398, 37.289525 55.802246)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 1360,
                        "selection": "LINESTRING(37.289525 55.802246, 37.288792 55.802063, 37.288146 55.801892, 37.287612 55.801740, 37.286962 55.801545, 37.286192 55.801302, 37.280304 55.799359, 37.279322 55.799043, 37.278324 55.798730, 37.277036 55.798332, 37.275116 55.797756, 37.273780 55.797377, 37.270786 55.796527, 37.270435 55.796426)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 39,
                        "selection": "LINESTRING(37.270435 55.796426, 37.269877 55.796265)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 2444,
                        "selection": "LINESTRING(37.269877 55.796265, 37.269000 55.795994, 37.268204 55.795725, 37.267466 55.795448, 37.266900 55.795219, 37.266295 55.794957, 37.265713 55.794688, 37.265157 55.794412, 37.264552 55.794094, 37.263867 55.793697, 37.263141 55.793246, 37.262498 55.792822, 37.260398 55.791381, 37.259702 55.790904, 37.259383 55.790685, 37.258755 55.790271, 37.258561 55.790151, 37.258142 55.789892, 37.257539 55.789549, 37.256949 55.789227, 37.256365 55.788930, 37.255809 55.788665, 37.255211 55.788394, 37.254591 55.788131, 37.254000 55.787892, 37.253322 55.787628, 37.252649 55.787390, 37.252294 55.787267, 37.251835 55.787108, 37.251238 55.786908, 37.247087 55.785519, 37.246428 55.785292, 37.245829 55.785064, 37.245255 55.784826, 37.244694 55.784567, 37.244112 55.784281, 37.243515 55.783975, 37.242956 55.783682, 37.241905 55.783089, 37.241012 55.782585, 37.240265 55.782163)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 45,
                        "selection": "LINESTRING(37.240265 55.782163, 37.239752 55.781873)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 1780,
                        "selection": "LINESTRING(37.239752 55.781873, 37.239004 55.781451, 37.237889 55.780822, 37.237187 55.780426, 37.236522 55.780057, 37.235831 55.779689, 37.235257 55.779391, 37.234576 55.779054, 37.233922 55.778747, 37.233825 55.778704, 37.233284 55.778461, 37.232755 55.778233, 37.232420 55.778096, 37.232154 55.777987, 37.231542 55.777755, 37.230953 55.777548, 37.230300 55.777331, 37.229671 55.777137, 37.229016 55.776953, 37.228958 55.776936, 37.228251 55.776756, 37.227536 55.776582, 37.226893 55.776439, 37.226195 55.776300, 37.225816 55.776231, 37.225437 55.776162, 37.224616 55.776032, 37.223814 55.775918, 37.223134 55.775834, 37.222892 55.775804, 37.221916 55.775706, 37.220776 55.775606, 37.219596 55.775515, 37.218155 55.775420, 37.214892 55.775226)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 20,
                        "selection": "LINESTRING(37.214892 55.775226, 37.214562 55.775206)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 1245,
                        "selection": "LINESTRING(37.214562 55.775206, 37.210970 55.774993, 37.208192 55.774828, 37.206910 55.774768, 37.205811 55.774736, 37.205237 55.774720, 37.204009 55.774690, 37.202983 55.774691, 37.202115 55.774709, 37.201964 55.774712, 37.201029 55.774757, 37.200028 55.774839, 37.199084 55.774936, 37.198087 55.775073, 37.196964 55.775261, 37.195705 55.775497, 37.194942 55.775645)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 44,
                        "selection": "LINESTRING(37.194942 55.775645, 37.194272 55.775775)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 1996,
                        "selection": "LINESTRING(37.194272 55.775775, 37.193258 55.775998, 37.192302 55.776222, 37.191402 55.776444, 37.190942 55.776559, 37.189106 55.777018, 37.188512 55.777167, 37.187931 55.777312, 37.186690 55.777617, 37.185670 55.777868, 37.184845 55.778062, 37.183946 55.778261, 37.183031 55.778455, 37.182317 55.778593, 37.181531 55.778737, 37.180696 55.778879, 37.179874 55.779011, 37.178992 55.779139, 37.178164 55.779248, 37.177282 55.779349, 37.171681 55.779938, 37.169868 55.780129, 37.168696 55.780252, 37.166307 55.780503, 37.165791 55.780564, 37.164874 55.780670, 37.163793 55.780803)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 88,
                        "selection": "LINESTRING(37.163793 55.780803, 37.162410 55.780973)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 2557,
                        "selection": "LINESTRING(37.162410 55.780973, 37.160858 55.781176, 37.159280 55.781404, 37.158500 55.781526, 37.157526 55.781681, 37.156711 55.781814, 37.156418 55.781866, 37.156305 55.781887, 37.155622 55.782008, 37.155301 55.782068, 37.154419 55.782231, 37.153399 55.782434, 37.152380 55.782647, 37.151808 55.782767, 37.150460 55.783064, 37.149170 55.783361, 37.148743 55.783458, 37.146910 55.783890, 37.141295 55.785270, 37.139383 55.785740, 37.137243 55.786283, 37.136050 55.786570, 37.135124 55.786781, 37.134138 55.786999, 37.133177 55.787192, 37.132231 55.787371, 37.132203 55.787376, 37.131460 55.787504, 37.130617 55.787636, 37.130300 55.787682, 37.129967 55.787730, 37.129222 55.787819, 37.128454 55.787899, 37.127674 55.787967, 37.126911 55.788017, 37.126137 55.788054, 37.126026 55.788057, 37.125371 55.788076, 37.124617 55.788083, 37.123851 55.788074, 37.123807 55.788073)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 147,
                        "selection": "LINESTRING(37.123807 55.788073, 37.123089 55.788052, 37.122323 55.788015, 37.121556 55.787961, 37.121462 55.787953)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 2277,
                        "selection": "LINESTRING(37.121462 55.787953, 37.120812 55.787897, 37.120414 55.787850, 37.120074 55.787810, 37.119329 55.787713, 37.118596 55.787603, 37.117851 55.787482, 37.112830 55.786603, 37.111843 55.786436, 37.110871 55.786276, 37.109884 55.786121, 37.108900 55.785970, 37.107912 55.785817, 37.106953 55.785690, 37.105962 55.785557, 37.104974 55.785434, 37.103958 55.785310, 37.102976 55.785202, 37.101963 55.785092, 37.101211 55.785012, 37.100467 55.784944, 37.099701 55.784883, 37.098969 55.784831, 37.098216 55.784787, 37.097455 55.784753, 37.096690 55.784725, 37.095921 55.784707, 37.095596 55.784702, 37.095156 55.784696, 37.094148 55.784688, 37.092378 55.784690, 37.090828 55.784703, 37.089281 55.784737, 37.088596 55.784757, 37.087770 55.784782, 37.086564 55.784827, 37.085801 55.784859)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 85,
                        "selection": "LINESTRING(37.085801 55.784859, 37.084440 55.784934)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 1612,
                        "selection": "LINESTRING(37.084440 55.784934, 37.084101 55.784953, 37.083218 55.785004, 37.076079 55.785423, 37.069821 55.785789, 37.069238 55.785828, 37.068568 55.785882, 37.067975 55.785943, 37.067346 55.786010, 37.066765 55.786091, 37.066212 55.786181, 37.065624 55.786289, 37.065017 55.786414, 37.064409 55.786554, 37.063762 55.786727, 37.063144 55.786911, 37.062453 55.787139, 37.061848 55.787360, 37.061294 55.787585, 37.061041 55.787695, 37.060779 55.787809, 37.060272 55.788052, 37.059896 55.788244)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 78,
                        "selection": "LINESTRING(37.059896 55.788244, 37.059449 55.788487, 37.059020 55.788745)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 5194,
                        "selection": "LINESTRING(37.059020 55.788745, 37.058629 55.788992, 37.058241 55.789248, 37.057823 55.789533, 37.057387 55.789850, 37.050880 55.794795, 37.046867 55.797845, 37.042853 55.800895, 37.038839 55.803944, 37.034825 55.806994, 37.033062 55.808333, 37.030705 55.810124, 37.028698 55.811648, 37.027098 55.812863, 37.026299 55.813446, 37.026203 55.813515, 37.025495 55.814020, 37.024665 55.814588, 37.023814 55.815136, 37.022983 55.815631, 37.022433 55.815939, 37.022061 55.816134, 37.021804 55.816268, 37.021236 55.816549, 37.020658 55.816815, 37.020001 55.817096, 37.019280 55.817380, 37.018587 55.817626, 37.017954 55.817827, 37.017266 55.818027, 37.016585 55.818204, 37.015947 55.818356, 37.015248 55.818505, 37.014658 55.818615, 37.014220 55.818689, 37.014071 55.818714, 37.013350 55.818822, 37.012557 55.818922, 37.011760 55.819009, 37.011008 55.819076, 37.010212 55.819138, 37.009463 55.819180, 37.008628 55.819215, 37.007764 55.819240, 37.006753 55.819258, 37.005569 55.819265, 37.004449 55.819263, 37.004416 55.819262, 37.001564 55.819224)",
                        "style": "normal"
                      }
                    ],
                    "names": [
                      "Новорижское шоссе"
                    ]
                  },
                  "outcoming_path_comment": "27 км прямо",
                  "turn_angle": 5,
                  "turn_direction": "keep_right",
                  "type": "crossroad"
                },
                {
                  "comment": "Держитесь правее",
                  "icon": "crossroad_keep_right",
                  "id": "9387171085178725049",
                  "outcoming_path": {
                    "distance": 2816,
                    "duration": 189,
                    "geometry": [
                      {
                        "color": "fast",
                        "length": 2816,
                        "selection": "LINESTRING(37.001564 55.819224, 37.001264 55.819273, 37.001063 55.819287, 37.000712 55.819288, 37.000427 55.819286, 37.000278 55.819284, 37.000159 55.819293, 36.999712 55.819326, 36.999316 55.819362, 36.998889 55.819391, 36.998520 55.819403, 36.996897 55.819412, 36.996668 55.819426, 36.996464 55.819453, 36.996259 55.819506, 36.996103 55.819578, 36.995993 55.819667, 36.995936 55.819766, 36.995903 55.819860, 36.995497 55.820870, 36.995489 55.820886, 36.995445 55.820935, 36.995376 55.820973, 36.995233 55.821045, 36.995159 55.821086, 36.995092 55.821133, 36.995039 55.821176, 36.995000 55.821220, 36.994992 55.821370, 36.994989 55.821468, 36.994986 55.821609, 36.994999 55.821763, 36.995224 55.823663, 36.995243 55.823870, 36.995509 55.826176, 36.995567 55.827325, 36.995604 55.827431, 36.995656 55.827546, 36.995729 55.827662, 36.995930 55.827958, 36.998354 55.830853, 36.998624 55.831174, 36.999989 55.832810, 37.000639 55.833665, 37.001560 55.834878, 37.002579 55.836220, 37.003482 55.837409, 37.004256 55.838428, 37.004325 55.838520, 37.004814 55.839162, 37.005054 55.839473, 37.005536 55.840029, 37.005611 55.840115, 37.005744 55.840231, 37.005891 55.840320, 37.005996 55.840388)",
                        "style": "normal"
                      }
                    ],
                    "names": []
                  },
                  "outcoming_path_comment": "2.8 км прямо",
                  "turn_angle": 14,
                  "turn_direction": "keep_right",
                  "type": "crossroad"
                },
                {
                  "comment": "Поворот налево на ул. Троицкая",
                  "icon": "crossroad_left",
                  "id": "748332104628525800",
                  "outcoming_path": {
                    "distance": 317,
                    "duration": 24,
                    "geometry": [
                      {
                        "color": "fast",
                        "length": 317,
                        "selection": "LINESTRING(37.005996 55.840388, 37.005322 55.840850, 37.004862 55.841165, 37.004542 55.841354, 37.004157 55.841530, 37.003781 55.841671, 37.002632 55.842062, 37.002162 55.842222)",
                        "style": "normal"
                      }
                    ],
                    "names": [
                      "Троицкая"
                    ]
                  },
                  "outcoming_path_comment": "300 м прямо",
                  "turn_angle": -77,
                  "turn_direction": "left",
                  "type": "crossroad"
                },
                {
                  "comment": "Поворот направо на ул. Университетская",
                  "icon": "crossroad_right",
                  "id": "10310739954058545071",
                  "outcoming_path": {
                    "distance": 419,
                    "duration": 63,
                    "geometry": [
                      {
                        "color": "fast",
                        "length": 247,
                        "selection": "LINESTRING(37.002162 55.842222, 37.002091 55.842263, 37.002047 55.842298, 37.002016 55.842336, 37.002002 55.842383, 37.002013 55.842436, 37.002026 55.842482, 37.002061 55.842520, 37.002331 55.842819, 37.003381 55.843966, 37.003618 55.844217)",
                        "style": "normal"
                      },
                      {
                        "color": "ignore",
                        "length": 172,
                        "selection": "LINESTRING(37.003618 55.844217, 37.003679 55.844286, 37.003878 55.844505, 37.005099 55.845517)",
                        "style": "normal"
                      }
                    ],
                    "names": [
                      "Университетская"
                    ]
                  },
                  "outcoming_path_comment": "400 м прямо",
                  "turn_angle": 86,
                  "turn_direction": "right",
                  "type": "crossroad"
                },
                {
                  "comment": "Поворот направо",
                  "icon": "crossroad_right",
                  "id": "1738549406607495798",
                  "outcoming_path": {
                    "distance": 388,
                    "duration": 90,
                    "geometry": [
                      {
                        "color": "ignore",
                        "length": 388,
                        "selection": "LINESTRING(37.005099 55.845517, 37.005234 55.845494, 37.005772 55.845405, 37.006056 55.845360, 37.006681 55.845262, 37.006832 55.845238, 37.007927 55.845066, 37.008148 55.845015, 37.008149 55.844941, 37.008136 55.844725, 37.008142 55.844647, 37.008149 55.844585, 37.008169 55.844523, 37.008218 55.844460, 37.008343 55.844375, 37.008481 55.844307, 37.008675 55.844236, 37.008882 55.844179, 37.009453 55.844054, 37.009650 55.844021, 37.010065 55.843978)",
                        "style": "normal"
                      }
                    ],
                    "names": []
                  },
                  "outcoming_path_comment": "400 м прямо",
                  "turn_angle": 73,
                  "turn_direction": "right",
                  "type": "crossroad"
                },
                {
                  "comment": "Поворот налево",
                  "icon": "crossroad_left",
                  "id": "4169917133217425027",
                  "outcoming_path": {
                    "distance": 28,
                    "duration": 6,
                    "geometry": [
                      {
                        "color": "ignore",
                        "length": 28,
                        "selection": "LINESTRING(37.010065 55.843978, 37.010177 55.844224)",
                        "style": "normal"
                      }
                    ],
                    "names": []
                  },
                  "outcoming_path_comment": "30 м прямо",
                  "turn_angle": -89,
                  "turn_direction": "left",
                  "type": "crossroad"
                },
                {
                  "comment": "Плавный поворот налево",
                  "icon": "crossroad_slightly_left",
                  "id": "10188597468547319581",
                  "outcoming_path": {
                    "distance": 48,
                    "duration": 11,
                    "geometry": [
                      {
                        "color": "ignore",
                        "length": 48,
                        "selection": "LINESTRING(37.010177 55.844224, 37.010149 55.844275, 37.010266 55.844615, 37.010302 55.844646)",
                        "style": "normal"
                      }
                    ],
                    "names": []
                  },
                  "outcoming_path_comment": "50 м прямо",
                  "turn_angle": -31,
                  "turn_direction": "slightly_left",
                  "type": "crossroad"
                },
                {
                  "comment": "finish",
                  "icon": "finish",
                  "id": "12693883050371245949",
                  "outcoming_path_comment": "Вы на месте!",
                  "type": "end"
                }
              ],
              "reliability": 0,
              "route_id": "moscow-tax-back.m9/taxirouting/1759612036.032673",
              "total_distance": 44164,
              "total_duration": 1967,
              "type": "taxirouting",
              "ui_total_distance": {
                "unit": "км",
                "value": "44"
              },
              "ui_total_duration": "32 мин",
              "waypoints": [
                {
                  "original_point": {
                    "lat": 55.89960114494936,
                    "lon": 37.38744401669042
                  },
                  "projected_point": {
                    "lat": 55.89960114494936,
                    "lon": 37.38744401669042
                  },
                  "transit": false
                },
                {
                  "original_point": {
                    "lat": 55.84464637610425,
                    "lon": 37.01030224483337
                  },
                  "projected_point": {
                    "lat": 55.84464637610425,
                    "lon": 37.01030224483337
                  },
                  "transit": false
                }
              ]
            }
          }
        ],
        "description": "Пеший переход или общественный транспорт до места еды"
      },
      {
        "stage_id": "stage_3",
        "start_point": {
          "name": "ресторан/кафе рядом с парком",
          "latitude": 55.844946,
          "longitude": 37.01015,
          "point_type": "start",
          "description": null,
          "address": "ресторан/кафе рядом с парком"
        },
        "end_point": {
          "name": "метро Сокольники",
          "latitude": 55.722847,
          "longitude": 37.674881,
          "point_type": "end",
          "description": null,
          "address": "1-я Дубровская улица, 13а ст1"
        },
        "waypoints": null,
        "transport_preference": "fastest",
        "route_preference": "fastest",
        "routes": [
          {
            "route_id": "taxi_1",
            "total_distance": 58709,
            "total_duration": 2954,
            "transfer_count": 0,
            "transport_types": [
              "taxi"
            ],
            "segments": [],
            "summary": "Маршрут taxi: 49 мин, 59 км",
            "raw_data": {
              "algorithm": "учтём выделенные полосы и пробки",
              "begin_pedestrian_path": {
                "geometry": {
                  "selection": "LINESTRING(37.010149 55.844946, 37.010302 55.844646)"
                }
              },
              "end_pedestrian_path": {
                "geometry": {
                  "selection": "LINESTRING(37.675276 55.722359, 37.674881 55.722847)"
                }
              },
              "filter_road_types": [
                "highway"
              ],
              "id": "9612052633633336252",
              "maneuvers": [
                {
                  "comment": "start",
                  "icon": "start",
                  "id": "7438023723370736770",
                  "outcoming_path": {
                    "distance": 48,
                    "duration": 11,
                    "geometry": [
                      {
                        "color": "ignore",
                        "length": 48,
                        "selection": "LINESTRING(37.010302 55.844646, 37.010266 55.844615, 37.010149 55.844275, 37.010177 55.844224)",
                        "style": "normal"
                      }
                    ],
                    "names": []
                  },
                  "outcoming_path_comment": "50 м прямо",
                  "type": "begin"
                },
                {
                  "comment": "Плавный поворот направо",
                  "icon": "crossroad_slightly_right",
                  "id": "3995327697975504837",
                  "outcoming_path": {
                    "distance": 28,
                    "duration": 7,
                    "geometry": [
                      {
                        "color": "ignore",
                        "length": 28,
                        "selection": "LINESTRING(37.010177 55.844224, 37.010065 55.843978)",
                        "style": "normal"
                      }
                    ],
                    "names": []
                  },
                  "outcoming_path_comment": "30 м прямо",
                  "turn_angle": 31,
                  "turn_direction": "slightly_right",
                  "type": "crossroad"
                },
                {
                  "comment": "Поворот направо",
                  "icon": "crossroad_right",
                  "id": "6900146992079057832",
                  "outcoming_path": {
                    "distance": 388,
                    "duration": 91,
                    "geometry": [
                      {
                        "color": "ignore",
                        "length": 388,
                        "selection": "LINESTRING(37.010065 55.843978, 37.009650 55.844021, 37.009453 55.844054, 37.008882 55.844179, 37.008675 55.844236, 37.008481 55.844307, 37.008343 55.844375, 37.008218 55.844460, 37.008169 55.844523, 37.008149 55.844585, 37.008142 55.844647, 37.008136 55.844725, 37.008149 55.844941, 37.008148 55.845015, 37.007927 55.845066, 37.006832 55.845238, 37.006681 55.845262, 37.006056 55.845360, 37.005772 55.845405, 37.005234 55.845494, 37.005099 55.845517)",
                        "style": "normal"
                      }
                    ],
                    "names": []
                  },
                  "outcoming_path_comment": "400 м прямо",
                  "turn_angle": 89,
                  "turn_direction": "right",
                  "type": "crossroad"
                },
                {
                  "comment": "Поворот налево на ул. Университетская",
                  "icon": "crossroad_left",
                  "id": "16100823503222197475",
                  "outcoming_path": {
                    "distance": 387,
                    "duration": 64,
                    "geometry": [
                      {
                        "color": "ignore",
                        "length": 172,
                        "selection": "LINESTRING(37.005099 55.845517, 37.003878 55.844505, 37.003679 55.844286, 37.003618 55.844217)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 215,
                        "selection": "LINESTRING(37.003618 55.844217, 37.003381 55.843966, 37.002331 55.842819, 37.002061 55.842520, 37.002026 55.842482)",
                        "style": "normal"
                      }
                    ],
                    "names": [
                      "Университетская"
                    ]
                  },
                  "outcoming_path_comment": "400 м прямо",
                  "turn_angle": -73,
                  "turn_direction": "left",
                  "type": "crossroad"
                },
                {
                  "comment": "Поворот налево на ул. Троицкая",
                  "icon": "crossroad_left",
                  "id": "15249914584469751386",
                  "outcoming_path": {
                    "distance": 357,
                    "duration": 27,
                    "geometry": [
                      {
                        "color": "fast",
                        "length": 357,
                        "selection": "LINESTRING(37.002026 55.842482, 37.001883 55.842317, 37.002162 55.842222, 37.002632 55.842062, 37.003781 55.841671, 37.004157 55.841530, 37.004542 55.841354, 37.004862 55.841165, 37.005322 55.840850, 37.005996 55.840388)",
                        "style": "normal"
                      }
                    ],
                    "names": [
                      "Троицкая"
                    ]
                  },
                  "outcoming_path_comment": "350 м прямо",
                  "turn_angle": -86,
                  "turn_direction": "left",
                  "type": "crossroad"
                },
                {
                  "comment": "Поворот направо",
                  "icon": "crossroad_right",
                  "id": "16710171797326899812",
                  "outcoming_path": {
                    "distance": 2432,
                    "duration": 199,
                    "geometry": [
                      {
                        "color": "fast",
                        "length": 2432,
                        "selection": "LINESTRING(37.005996 55.840388, 37.005891 55.840320, 37.005744 55.840231, 37.005611 55.840115, 37.005536 55.840029, 37.005054 55.839473, 37.004814 55.839162, 37.004325 55.838520, 37.004256 55.838428, 37.003482 55.837409, 37.002579 55.836220, 37.001560 55.834878, 37.000639 55.833665, 36.999989 55.832810, 36.998624 55.831174, 36.998354 55.830853, 36.995930 55.827958, 36.995729 55.827662, 36.995656 55.827546, 36.995604 55.827431, 36.995567 55.827325, 36.995509 55.826176, 36.995243 55.823870, 36.995224 55.823663, 36.994999 55.821763, 36.994986 55.821609, 36.994989 55.821468, 36.994992 55.821370, 36.995000 55.821220, 36.995009 55.821170, 36.995005 55.821115, 36.994995 55.821063, 36.994971 55.821003, 36.994897 55.820886, 36.994882 55.820832, 36.994890 55.820793, 36.995190 55.820046, 36.995296 55.819783)",
                        "style": "normal"
                      }
                    ],
                    "names": []
                  },
                  "outcoming_path_comment": "2.4 км прямо",
                  "turn_angle": 77,
                  "turn_direction": "right",
                  "type": "crossroad"
                },
                {
                  "comment": "Плавный поворот налево на ул. Северная",
                  "icon": "crossroad_slightly_left",
                  "id": "14236987763901243474",
                  "outcoming_path": {
                    "distance": 1194,
                    "duration": 83,
                    "geometry": [
                      {
                        "color": "fast",
                        "length": 1044,
                        "selection": "LINESTRING(36.995296 55.819783, 36.995347 55.819719, 36.995417 55.819680, 36.995556 55.819605, 36.995639 55.819550, 36.995717 55.819494, 36.995777 55.819438, 36.995819 55.819390, 36.995869 55.819323, 36.996088 55.818742, 36.996250 55.818454, 36.996424 55.818202, 36.996435 55.818187, 36.996653 55.817915, 36.996936 55.817584, 36.997207 55.817302, 36.997402 55.817124, 36.997619 55.816954, 36.997784 55.816844, 37.000056 55.815337, 37.000245 55.815211, 37.000465 55.815057, 37.000695 55.814887, 37.001437 55.814319, 37.001718 55.814104, 37.002470 55.813528, 37.002996 55.813125, 37.003841 55.812499, 37.004501 55.812009)",
                        "style": "normal"
                      },
                      {
                        "color": "normal",
                        "length": 150,
                        "selection": "LINESTRING(37.004501 55.812009, 37.004631 55.811921, 37.005076 55.811625, 37.005197 55.811536, 37.005307 55.811444, 37.005401 55.811350, 37.005476 55.811250, 37.005533 55.811158, 37.005578 55.811054, 37.005609 55.810958, 37.005622 55.810851)",
                        "style": "normal"
                      }
                    ],
                    "names": [
                      "Северная"
                    ]
                  },
                  "outcoming_path_comment": "1.2 км прямо",
                  "turn_angle": -20,
                  "turn_direction": "slightly_left",
                  "type": "crossroad"
                },
                {
                  "comment": "Поворот налево на ул. Центральная",
                  "icon": "crossroad_left",
                  "id": "9178647206061096200",
                  "outcoming_path": {
                    "distance": 1165,
                    "duration": 83,
                    "geometry": [
                      {
                        "color": "fast",
                        "length": 1165,
                        "selection": "LINESTRING(37.005622 55.810851, 37.007224 55.810749, 37.007424 55.810736, 37.008573 55.810663, 37.008671 55.810657, 37.008888 55.810643, 37.010898 55.810515, 37.012703 55.810316, 37.012722 55.810313, 37.012833 55.810290, 37.013064 55.810241, 37.013402 55.810138, 37.013590 55.810079, 37.014329 55.809848, 37.014668 55.809743, 37.015020 55.809648, 37.015334 55.809570, 37.015648 55.809509, 37.015681 55.809503, 37.016726 55.809311, 37.016801 55.809297, 37.018146 55.809114, 37.019942 55.808870, 37.020128 55.808858, 37.020682 55.808823, 37.021226 55.808801, 37.021380 55.808795, 37.022015 55.808795, 37.022344 55.808796, 37.022581 55.808798, 37.023193 55.808814, 37.023771 55.808849)",
                        "style": "normal"
                      }
                    ],
                    "names": [
                      "Центральная"
                    ]
                  },
                  "outcoming_path_comment": "1.2 км прямо",
                  "turn_angle": -75,
                  "turn_direction": "left",
                  "type": "crossroad"
                },
                {
                  "comment": "Круговое движение 2 съезд на ул. Новорижское шоссе",
                  "icon": "ringroad_left_90",
                  "id": "11594604508219677525",
                  "outcoming_path": {
                    "distance": 210,
                    "duration": 18,
                    "geometry": [
                      {
                        "color": "fast",
                        "length": 210,
                        "selection": "LINESTRING(37.023771 55.808849, 37.024217 55.808868, 37.024385 55.808863, 37.024537 55.808848, 37.024678 55.808836, 37.024813 55.808839, 37.024960 55.808850, 37.026137 55.808934, 37.026446 55.808955, 37.026554 55.808983, 37.026600 55.809004, 37.026635 55.809027, 37.026663 55.809050, 37.026683 55.809077, 37.026697 55.809103, 37.026699 55.809134, 37.026698 55.809163, 37.026686 55.809190, 37.026672 55.809217, 37.026647 55.809242, 37.026616 55.809263)",
                        "style": "normal"
                      }
                    ],
                    "names": [
                      "Новорижское шоссе"
                    ]
                  },
                  "outcoming_path_comment": "200 м прямо",
                  "ringroad_exit_number": 2,
                  "turn_angle": -85,
                  "type": "ringroad"
                },
                {
                  "comment": "2 съезд на ул. Новорижское шоссе",
                  "icon": "ringroad_exit",
                  "id": "17235647658527505817",
                  "outcoming_path": {
                    "distance": 36329,
                    "duration": 1446,
                    "geometry": [
                      {
                        "color": "fast",
                        "length": 3398,
                        "selection": "LINESTRING(37.026616 55.809263, 37.026554 55.809311, 37.026520 55.809356, 37.026473 55.809598, 37.026446 55.809864, 37.026459 55.810064, 37.026529 55.810219, 37.026639 55.810339, 37.026789 55.810435, 37.027892 55.810921, 37.028030 55.810953, 37.028155 55.810968, 37.028312 55.810975, 37.028494 55.810969, 37.028670 55.810949, 37.028850 55.810913, 37.029003 55.810866, 37.029180 55.810796, 37.029302 55.810733, 37.029466 55.810649, 37.029616 55.810574, 37.029978 55.810374, 37.034046 55.807284, 37.035717 55.806014, 37.039634 55.803039, 37.043552 55.800062, 37.047470 55.797085, 37.052182 55.793504, 37.057132 55.789743, 37.057574 55.789421, 37.057997 55.789132, 37.058389 55.788873, 37.058786 55.788623)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 79,
                        "selection": "LINESTRING(37.058786 55.788623, 37.059223 55.788361, 37.059678 55.788113)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 1604,
                        "selection": "LINESTRING(37.059678 55.788113, 37.060062 55.787917, 37.060579 55.787669, 37.060848 55.787552, 37.061103 55.787441, 37.061667 55.787211, 37.062285 55.786986, 37.062990 55.786754, 37.063619 55.786566, 37.064281 55.786390, 37.064902 55.786246, 37.065515 55.786121, 37.066062 55.786015, 37.066720 55.785900, 37.067360 55.785804, 37.068027 55.785715, 37.068671 55.785647, 37.068942 55.785625, 37.069324 55.785592, 37.069953 55.785549, 37.070828 55.785497, 37.075025 55.785250, 37.076517 55.785162, 37.083175 55.784771, 37.084059 55.784719)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 85,
                        "selection": "LINESTRING(37.084059 55.784719, 37.085305 55.784646, 37.085414 55.784640)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 2289,
                        "selection": "LINESTRING(37.085414 55.784640, 37.086364 55.784596, 37.086534 55.784589, 37.087395 55.784553, 37.088637 55.784513, 37.089952 55.784485, 37.090997 55.784468, 37.092007 55.784461, 37.093307 55.784466, 37.095836 55.784493, 37.096633 55.784510, 37.097402 55.784534, 37.098143 55.784566, 37.098909 55.784606, 37.099379 55.784639, 37.099676 55.784659, 37.100428 55.784716, 37.101214 55.784787, 37.102443 55.784908, 37.103747 55.785048, 37.105038 55.785203, 37.105468 55.785254, 37.106497 55.785382, 37.107454 55.785510, 37.107491 55.785515, 37.108435 55.785647, 37.109469 55.785800, 37.110688 55.785987, 37.111892 55.786182, 37.112919 55.786356, 37.113523 55.786464, 37.115591 55.786829, 37.115952 55.786893, 37.117362 55.787142, 37.118087 55.787267, 37.118823 55.787379, 37.119184 55.787427, 37.119545 55.787475, 37.120320 55.787567, 37.121062 55.787635, 37.121292 55.787653)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 148,
                        "selection": "LINESTRING(37.121292 55.787653, 37.121778 55.787689, 37.122408 55.787726, 37.123083 55.787756, 37.123647 55.787772)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 2574,
                        "selection": "LINESTRING(37.123647 55.787772, 37.123809 55.787776, 37.124415 55.787780, 37.124791 55.787777, 37.125121 55.787774, 37.125832 55.787756, 37.126488 55.787729, 37.127206 55.787687, 37.127888 55.787635, 37.128556 55.787574, 37.129198 55.787505, 37.129923 55.787412, 37.130627 55.787313, 37.131372 55.787201, 37.132110 55.787080, 37.132827 55.786951, 37.133598 55.786802, 37.134502 55.786621, 37.135270 55.786463, 37.136143 55.786273, 37.137016 55.786079, 37.138490 55.785739, 37.139158 55.785585, 37.140167 55.785352, 37.141477 55.785030, 37.143552 55.784520, 37.146684 55.783751, 37.146785 55.783725, 37.148622 55.783292, 37.150342 55.782897, 37.151695 55.782598, 37.153290 55.782265, 37.154317 55.782061, 37.155524 55.781838, 37.156160 55.781724, 37.156618 55.781643, 37.157758 55.781456, 37.158288 55.781373, 37.158984 55.781264, 37.159198 55.781230, 37.160783 55.781001, 37.162579 55.780768)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 88,
                        "selection": "LINESTRING(37.162579 55.780768, 37.163961 55.780598)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 1980,
                        "selection": "LINESTRING(37.163961 55.780598, 37.164807 55.780494, 37.165717 55.780389, 37.166246 55.780327, 37.172611 55.779657, 37.174649 55.779443, 37.177221 55.779172, 37.178096 55.779073, 37.178916 55.778965, 37.179790 55.778837, 37.180607 55.778707, 37.181436 55.778566, 37.182216 55.778422, 37.182516 55.778364, 37.182923 55.778286, 37.183832 55.778093, 37.184726 55.777895, 37.185545 55.777703, 37.186563 55.777452, 37.187096 55.777321, 37.187803 55.777147, 37.188977 55.776854, 37.189844 55.776637, 37.191274 55.776279, 37.192177 55.776057, 37.193139 55.775832, 37.194163 55.775606)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 46,
                        "selection": "LINESTRING(37.194163 55.775606, 37.194859 55.775471)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 1253,
                        "selection": "LINESTRING(37.194859 55.775471, 37.195604 55.775326, 37.196869 55.775089, 37.198005 55.774900, 37.199018 55.774760, 37.199977 55.774662, 37.200993 55.774579, 37.201867 55.774537, 37.201945 55.774533, 37.202977 55.774511, 37.204016 55.774510, 37.204459 55.774521, 37.205252 55.774540, 37.206930 55.774588, 37.208222 55.774649, 37.210324 55.774774, 37.214595 55.775028)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 20,
                        "selection": "LINESTRING(37.214595 55.775028, 37.214925 55.775048)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 1795,
                        "selection": "LINESTRING(37.214925 55.775048, 37.215394 55.775075, 37.218190 55.775241, 37.219636 55.775337, 37.220822 55.775428, 37.221968 55.775529, 37.222580 55.775590, 37.222954 55.775628, 37.223888 55.775743, 37.224699 55.775858, 37.225528 55.775990, 37.226297 55.776129, 37.227005 55.776271, 37.227658 55.776416, 37.228379 55.776591, 37.229095 55.776774, 37.229819 55.776978, 37.230458 55.777175, 37.231118 55.777394, 37.231716 55.777605, 37.232337 55.777840, 37.232946 55.778089, 37.233480 55.778319, 37.234123 55.778608, 37.234622 55.778842, 37.234783 55.778918, 37.235470 55.779257, 37.236048 55.779557, 37.236540 55.779819, 37.236743 55.779927, 37.237412 55.780298, 37.238137 55.780707, 37.239229 55.781324, 37.239988 55.781753)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 44,
                        "selection": "LINESTRING(37.239988 55.781753, 37.240491 55.782036)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 2440,
                        "selection": "LINESTRING(37.240491 55.782036, 37.241237 55.782457, 37.242850 55.783368, 37.243177 55.783553, 37.243731 55.783842, 37.244324 55.784147, 37.244899 55.784430, 37.245147 55.784545, 37.245451 55.784684, 37.246006 55.784914, 37.246600 55.785141, 37.247250 55.785365, 37.251409 55.786756, 37.252000 55.786954, 37.252817 55.787237, 37.253498 55.787478, 37.254184 55.787746, 37.254780 55.787986, 37.255407 55.788252, 37.256012 55.788527, 37.256574 55.788795, 37.257167 55.789096, 37.257763 55.789421, 37.258372 55.789768, 37.258796 55.790030, 37.258994 55.790152, 37.259628 55.790570, 37.259944 55.790788, 37.260644 55.791268, 37.262743 55.792707, 37.263380 55.793127, 37.264100 55.793574, 37.264776 55.793966, 37.265371 55.794278, 37.265919 55.794551, 37.266516 55.794826, 37.267091 55.795075, 37.267648 55.795300, 37.268375 55.795573, 37.269159 55.795838, 37.270027 55.796106)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 38,
                        "selection": "LINESTRING(37.270027 55.796106, 37.270581 55.796266)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 1357,
                        "selection": "LINESTRING(37.270581 55.796266, 37.270931 55.796367, 37.275263 55.797596, 37.277188 55.798174, 37.278478 55.798573, 37.279478 55.798886, 37.280464 55.799204, 37.286351 55.801146, 37.287116 55.801388, 37.287758 55.801580, 37.288285 55.801731, 37.288924 55.801899, 37.289653 55.802082)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 57,
                        "selection": "LINESTRING(37.289653 55.802082, 37.290493 55.802282)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 836,
                        "selection": "LINESTRING(37.290493 55.802282, 37.291119 55.802431, 37.292333 55.802721, 37.293017 55.802880, 37.293721 55.803035, 37.294358 55.803165, 37.295106 55.803311, 37.295855 55.803440, 37.296543 55.803542, 37.297296 55.803638, 37.298153 55.803730, 37.299062 55.803808, 37.300100 55.803872, 37.301188 55.803912, 37.302868 55.803928, 37.303400 55.803925)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 253,
                        "selection": "LINESTRING(37.303400 55.803925, 37.305313 55.803914, 37.307210 55.803902, 37.307462 55.803894)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 595,
                        "selection": "LINESTRING(37.307462 55.803894, 37.307583 55.803890, 37.308332 55.803866, 37.309306 55.803814, 37.309785 55.803783, 37.311006 55.803688, 37.311798 55.803614, 37.312571 55.803522, 37.313328 55.803414, 37.314116 55.803285, 37.315065 55.803111, 37.315930 55.802938, 37.316729 55.802763)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 77,
                        "selection": "LINESTRING(37.316729 55.802763, 37.317876 55.802506)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 263,
                        "selection": "LINESTRING(37.317876 55.802506, 37.318050 55.802466, 37.318455 55.802376, 37.319578 55.802125, 37.321143 55.801780, 37.321794 55.801653)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 72,
                        "selection": "LINESTRING(37.321794 55.801653, 37.322888 55.801441)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 560,
                        "selection": "LINESTRING(37.322888 55.801441, 37.323472 55.801328, 37.324549 55.801139, 37.325675 55.800954, 37.326628 55.800816, 37.327905 55.800649, 37.329241 55.800500, 37.330614 55.800348, 37.330951 55.800312, 37.331590 55.800242)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 347,
                        "selection": "LINESTRING(37.331590 55.800242, 37.331836 55.800216, 37.336777 55.799654, 37.337017 55.799625)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 3556,
                        "selection": "LINESTRING(37.337017 55.799625, 37.338594 55.799434, 37.339552 55.799309, 37.340471 55.799171, 37.341304 55.799030, 37.342130 55.798866, 37.342931 55.798699, 37.343261 55.798622, 37.343620 55.798537, 37.344310 55.798366, 37.344924 55.798198, 37.345559 55.798011, 37.346229 55.797800, 37.346926 55.797552, 37.347484 55.797337, 37.348069 55.797105, 37.348776 55.796815, 37.348799 55.796805, 37.349677 55.796435, 37.350642 55.796016, 37.351555 55.795611, 37.352756 55.795073, 37.354003 55.794516, 37.354358 55.794357, 37.355032 55.794063, 37.355749 55.793774, 37.356141 55.793628, 37.356528 55.793485, 37.357024 55.793315, 37.357596 55.793120, 37.358138 55.792933, 37.358980 55.792650, 37.359746 55.792408, 37.360514 55.792185, 37.361292 55.791990, 37.362125 55.791796, 37.362362 55.791746, 37.364169 55.791363, 37.364804 55.791228, 37.366050 55.790970, 37.366141 55.790950, 37.368248 55.790533, 37.368812 55.790414, 37.371897 55.789782, 37.372744 55.789615, 37.373164 55.789538, 37.376955 55.788829, 37.377209 55.788782, 37.378007 55.788634, 37.378068 55.788623, 37.379489 55.788368, 37.379922 55.788291, 37.381361 55.788035, 37.384325 55.787526, 37.385006 55.787407, 37.385771 55.787274, 37.386355 55.787158, 37.386831 55.787046, 37.387261 55.786930, 37.387647 55.786810, 37.387981 55.786693, 37.388304 55.786571)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 2504,
                        "selection": "LINESTRING(37.388304 55.786571, 37.388905 55.786317, 37.389426 55.786087, 37.389816 55.785874, 37.390199 55.785641, 37.390562 55.785378, 37.390927 55.785089, 37.391209 55.784836, 37.391558 55.784480, 37.391857 55.784135, 37.392280 55.783592, 37.393710 55.781757, 37.394907 55.780376, 37.395129 55.780152, 37.396302 55.778970, 37.398039 55.777475, 37.398939 55.776844, 37.400071 55.776051, 37.401990 55.774897, 37.404224 55.773724, 37.404522 55.773567, 37.405129 55.773276, 37.405836 55.772973, 37.406479 55.772739, 37.407068 55.772561, 37.407795 55.772387, 37.408508 55.772259, 37.409272 55.772165, 37.409470 55.772150, 37.410057 55.772104, 37.410789 55.772080, 37.411540 55.772077, 37.412199 55.772092, 37.415226 55.772190)",
                        "style": "tunnel"
                      },
                      {
                        "color": "fast",
                        "length": 1088,
                        "selection": "LINESTRING(37.415226 55.772190, 37.417217 55.772255, 37.417882 55.772263, 37.418681 55.772282, 37.419094 55.772292, 37.419327 55.772300, 37.419489 55.772305, 37.419827 55.772312, 37.420209 55.772325, 37.420334 55.772326, 37.421478 55.772363, 37.421605 55.772367, 37.421957 55.772383, 37.422305 55.772391, 37.423104 55.772415, 37.423271 55.772420, 37.423662 55.772432, 37.423769 55.772435, 37.423886 55.772439, 37.424018 55.772443, 37.424156 55.772445, 37.424466 55.772456, 37.424600 55.772460, 37.424784 55.772467, 37.424923 55.772471, 37.425082 55.772476, 37.425194 55.772480, 37.425747 55.772496, 37.425824 55.772498, 37.425940 55.772501, 37.426816 55.772516, 37.428083 55.772555, 37.429600 55.772602, 37.430349 55.772625, 37.430497 55.772628, 37.430703 55.772636, 37.430741 55.772636, 37.430829 55.772639, 37.431793 55.772660, 37.432572 55.772680)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 1567,
                        "public_transport_lane": true,
                        "selection": "LINESTRING(37.432572 55.772680, 37.433366 55.772722, 37.433665 55.772745, 37.434356 55.772796, 37.435206 55.772904, 37.435957 55.773038, 37.436711 55.773231, 37.437621 55.773541, 37.438372 55.773821, 37.438751 55.773977, 37.439113 55.774126, 37.442534 55.775797, 37.446164 55.777570, 37.446517 55.777720, 37.446900 55.777882, 37.447826 55.778216, 37.448742 55.778462, 37.449646 55.778641, 37.450516 55.778778, 37.450956 55.778820, 37.451454 55.778867, 37.452371 55.778899, 37.453263 55.778877, 37.454108 55.778815)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 136,
                        "public_transport_lane": true,
                        "selection": "LINESTRING(37.454108 55.778815, 37.454941 55.778718, 37.455530 55.778621, 37.456208 55.778510)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 321,
                        "selection": "LINESTRING(37.456208 55.778510, 37.457974 55.778222, 37.458223 55.778181, 37.458964 55.778060, 37.459024 55.778050, 37.459486 55.777972, 37.460531 55.777795, 37.460641 55.777772, 37.460983 55.777702, 37.461175 55.777660)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 1547,
                        "public_transport_lane": true,
                        "selection": "LINESTRING(37.461175 55.777660, 37.463075 55.777242, 37.463613 55.777130, 37.464133 55.777032, 37.464656 55.776941, 37.465112 55.776864, 37.468482 55.776385, 37.472222 55.775854, 37.474177 55.775577, 37.474675 55.775499, 37.475156 55.775418, 37.475591 55.775334, 37.475991 55.775247, 37.478129 55.774744, 37.478604 55.774638, 37.478999 55.774560, 37.479426 55.774483, 37.479527 55.774467, 37.479709 55.774437, 37.480439 55.774317, 37.480644 55.774285, 37.481762 55.774110, 37.482273 55.774030, 37.483225 55.773881, 37.483469 55.773843, 37.483710 55.773805, 37.484816 55.773632)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 228,
                        "selection": "LINESTRING(37.484816 55.773632, 37.485787 55.773480, 37.487113 55.773272, 37.487525 55.773207, 37.487905 55.773148, 37.488148 55.773110, 37.488371 55.773075)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 604,
                        "public_transport_lane": true,
                        "selection": "LINESTRING(37.488371 55.773075, 37.490352 55.772765, 37.493723 55.772282, 37.494100 55.772228, 37.495360 55.772029, 37.495934 55.771937, 37.496683 55.771811, 37.497684 55.771642)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 291,
                        "selection": "LINESTRING(37.497684 55.771642, 37.499825 55.771276, 37.500148 55.771222, 37.500821 55.771106, 37.502146 55.770881)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 2189,
                        "selection": "LINESTRING(37.502146 55.770881, 37.505745 55.770291, 37.507374 55.770047, 37.508772 55.769837, 37.511645 55.769435, 37.512962 55.769268, 37.518284 55.768592, 37.522037 55.768116, 37.522959 55.768000, 37.527957 55.767365, 37.528559 55.767293, 37.534163 55.766620, 37.534895 55.766503, 37.535793 55.766395, 37.536132 55.766354)",
                        "style": "bridge"
                      }
                    ],
                    "names": [
                      "Новорижское шоссе"
                    ]
                  },
                  "outcoming_path_comment": "36 км прямо",
                  "type": "ringroad_exit"
                },
                {
                  "comment": "Держитесь правее на ул. ТТК",
                  "icon": "crossroad_keep_right",
                  "id": "16754544352809365191",
                  "outcoming_path": {
                    "distance": 14330,
                    "duration": 727,
                    "geometry": [
                      {
                        "color": "fast",
                        "length": 185,
                        "selection": "LINESTRING(37.536132 55.766354, 37.536288 55.766312, 37.536512 55.766237, 37.536678 55.766156, 37.536803 55.766076, 37.536891 55.765992, 37.536927 55.765902, 37.536944 55.765810, 37.536928 55.765719, 37.536762 55.765347, 37.536573 55.764925)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 610,
                        "selection": "LINESTRING(37.536573 55.764925, 37.536182 55.764048, 37.536140 55.763912, 37.536122 55.763850, 37.535901 55.763046, 37.534970 55.760757, 37.534697 55.760316, 37.534662 55.760250, 37.534626 55.760183, 37.534315 55.759588)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 1831,
                        "selection": "LINESTRING(37.534315 55.759588, 37.533879 55.758608, 37.533864 55.758580, 37.533846 55.758551, 37.533808 55.758496, 37.533771 55.758430, 37.533737 55.758358, 37.533707 55.758290, 37.533672 55.758212, 37.533636 55.758133, 37.533607 55.758070, 37.533578 55.758008, 37.533537 55.757916, 37.533496 55.757827, 37.533462 55.757751, 37.533375 55.757561, 37.533302 55.757400, 37.533220 55.757221, 37.533195 55.757167, 37.533033 55.756741, 37.532828 55.756290, 37.531566 55.753393, 37.531436 55.752999, 37.531418 55.752919, 37.531380 55.752543, 37.531324 55.751859, 37.531341 55.751538, 37.531405 55.751118, 37.531571 55.750639, 37.531847 55.749974, 37.532077 55.749513, 37.532094 55.749471, 37.532104 55.749437, 37.532183 55.749109, 37.532920 55.746275, 37.533082 55.745728, 37.533181 55.745387, 37.533431 55.744455, 37.533588 55.743805, 37.533618 55.743716, 37.533683 55.743533, 37.533719 55.743426)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 114,
                        "selection": "LINESTRING(37.533719 55.743426, 37.533823 55.743126, 37.533903 55.742881, 37.533968 55.742716, 37.534122 55.742410)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 495,
                        "selection": "LINESTRING(37.534122 55.742410, 37.534129 55.742394, 37.534216 55.742194, 37.534462 55.741682, 37.534558 55.741496, 37.534611 55.741411, 37.535450 55.740059, 37.535568 55.739814, 37.535899 55.739355, 37.536137 55.739053, 37.536641 55.738494, 37.536928 55.738255)",
                        "style": "tunnel"
                      },
                      {
                        "color": "fast",
                        "length": 35,
                        "selection": "LINESTRING(37.536928 55.738255, 37.537246 55.737995)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 456,
                        "selection": "LINESTRING(37.537246 55.737995, 37.537686 55.737638, 37.537704 55.737627, 37.538269 55.737247, 37.538713 55.736961, 37.538995 55.736778, 37.539149 55.736665, 37.539261 55.736577, 37.541589 55.735122, 37.541892 55.734911, 37.541966 55.734852)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 635,
                        "selection": "LINESTRING(37.541966 55.734852, 37.542143 55.734711, 37.542380 55.734490, 37.542687 55.734140, 37.542751 55.734067, 37.542895 55.733838, 37.543027 55.733589, 37.543094 55.733389, 37.543188 55.733028, 37.543367 55.732189, 37.543467 55.731929, 37.543596 55.731676, 37.543733 55.731454, 37.543941 55.731180, 37.545496 55.729558)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 2790,
                        "selection": "LINESTRING(37.545496 55.729558, 37.546571 55.728436, 37.547646 55.727314, 37.548110 55.726830, 37.548511 55.726412, 37.549498 55.725382, 37.549824 55.725068, 37.550176 55.724758, 37.550558 55.724445, 37.550954 55.724144, 37.551346 55.723868, 37.551750 55.723602, 37.552117 55.723373, 37.552195 55.723327, 37.552537 55.723124, 37.552962 55.722893, 37.553402 55.722671, 37.553868 55.722455, 37.554296 55.722273, 37.554639 55.722133, 37.554824 55.722062, 37.555198 55.721928, 37.555365 55.721873, 37.555775 55.721737, 37.556289 55.721582, 37.556860 55.721433, 37.557558 55.721258, 37.558242 55.721076, 37.559114 55.720838, 37.562983 55.719667, 37.564866 55.719053, 37.570706 55.717150, 37.571021 55.717038, 37.571156 55.716990, 37.571557 55.716843, 37.571932 55.716691, 37.574746 55.715518, 37.575112 55.715343, 37.575468 55.715150, 37.575614 55.715063, 37.575800 55.714924, 37.575996 55.714783, 37.576150 55.714672, 37.576363 55.714518, 37.577015 55.714048, 37.577684 55.713571, 37.577915 55.713407, 37.577944 55.713386)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 101,
                        "selection": "LINESTRING(37.577944 55.713386, 37.578067 55.713299, 37.578227 55.713186, 37.578237 55.713178, 37.578345 55.713102, 37.578427 55.713038, 37.578918 55.712653)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 903,
                        "selection": "LINESTRING(37.578918 55.712653, 37.580349 55.711601, 37.580637 55.711410, 37.583389 55.709397, 37.583808 55.709088, 37.584338 55.708747, 37.585666 55.707988, 37.586703 55.707482, 37.588619 55.706720)",
                        "style": "tunnel"
                      },
                      {
                        "color": "fast",
                        "length": 1377,
                        "selection": "LINESTRING(37.588619 55.706720, 37.588689 55.706693, 37.589043 55.706589, 37.589758 55.706380, 37.590108 55.706269, 37.590503 55.706145, 37.592804 55.705491, 37.593517 55.705283, 37.594826 55.704918, 37.597225 55.704249, 37.599562 55.703596, 37.599788 55.703537, 37.602401 55.702861, 37.603634 55.702511, 37.604739 55.702160, 37.605949 55.701754, 37.606478 55.701582, 37.607002 55.701410, 37.607560 55.701255, 37.608131 55.701136, 37.608246 55.701119)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 206,
                        "selection": "LINESTRING(37.608246 55.701119, 37.608709 55.701051, 37.609313 55.700989, 37.609948 55.700963, 37.610648 55.700977, 37.611250 55.701018, 37.611495 55.701051)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 176,
                        "selection": "LINESTRING(37.611495 55.701051, 37.611874 55.701103, 37.612421 55.701214, 37.612533 55.701236, 37.612634 55.701262, 37.613078 55.701377, 37.613565 55.701525, 37.614067 55.701700)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 1486,
                        "selection": "LINESTRING(37.614067 55.701700, 37.614486 55.701879, 37.614627 55.701939, 37.614819 55.702038, 37.615199 55.702233, 37.615447 55.702381, 37.615690 55.702525, 37.616138 55.702854, 37.616199 55.702909, 37.616553 55.703228, 37.617496 55.704128, 37.617615 55.704242, 37.617914 55.704479, 37.618303 55.704722, 37.618764 55.704980, 37.619213 55.705210, 37.619710 55.705409, 37.620248 55.705574, 37.620813 55.705697, 37.621023 55.705730, 37.621247 55.705760, 37.621909 55.705815, 37.622430 55.705833, 37.622914 55.705816, 37.624993 55.705608, 37.625380 55.705570, 37.626099 55.705497, 37.626988 55.705409, 37.630522 55.705073, 37.630791 55.705047, 37.634348 55.704676)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 1399,
                        "selection": "LINESTRING(37.634348 55.704676, 37.635280 55.704579, 37.637259 55.704368, 37.637673 55.704327, 37.638401 55.704254, 37.641913 55.703902, 37.642159 55.703878, 37.642364 55.703857, 37.643318 55.703762, 37.643737 55.703721, 37.644221 55.703689, 37.645231 55.703621, 37.645814 55.703581, 37.646274 55.703560, 37.646460 55.703550, 37.649430 55.703289, 37.650087 55.703231, 37.650668 55.703222, 37.651179 55.703212, 37.652817 55.703185, 37.653824 55.703167, 37.655173 55.703150, 37.655489 55.703146, 37.655994 55.703155, 37.656507 55.703194, 37.656519 55.703195)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 182,
                        "selection": "LINESTRING(37.656519 55.703195, 37.657029 55.703260, 37.657657 55.703396, 37.658196 55.703542, 37.658695 55.703721, 37.659105 55.703906)",
                        "style": "bridge"
                      },
                      {
                        "color": "slow-jams",
                        "length": 502,
                        "selection": "LINESTRING(37.659105 55.703906, 37.659111 55.703909, 37.660717 55.704789, 37.664837 55.707048)",
                        "style": "normal"
                      },
                      {
                        "color": "slow",
                        "length": 361,
                        "selection": "LINESTRING(37.664837 55.707048, 37.668957 55.709307)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 82,
                        "selection": "LINESTRING(37.668957 55.709307, 37.669904 55.709826)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 404,
                        "selection": "LINESTRING(37.669904 55.709826, 37.672562 55.711283, 37.672921 55.711472, 37.673345 55.711662, 37.673820 55.711862, 37.674729 55.712223)",
                        "style": "bridge"
                      }
                    ],
                    "names": [
                      "ТТК"
                    ]
                  },
                  "outcoming_path_comment": "14 км прямо",
                  "turn_angle": 21,
                  "turn_direction": "keep_right",
                  "type": "crossroad"
                },
                {
                  "comment": "Держитесь правее на ул. Южнопортовая",
                  "icon": "crossroad_keep_right",
                  "id": "18244465098082667715",
                  "outcoming_path": {
                    "distance": 519,
                    "duration": 44,
                    "geometry": [
                      {
                        "color": "fast",
                        "length": 204,
                        "selection": "LINESTRING(37.674729 55.712223, 37.676058 55.712453, 37.676128 55.712469, 37.677705 55.712940)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 187,
                        "selection": "LINESTRING(37.677705 55.712940, 37.679249 55.713400, 37.679407 55.713423, 37.679562 55.713427, 37.679712 55.713416, 37.679855 55.713388, 37.680121 55.713337, 37.680258 55.713154)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 128,
                        "selection": "LINESTRING(37.680258 55.713154, 37.680735 55.712519, 37.681061 55.712084)",
                        "style": "normal"
                      }
                    ],
                    "names": [
                      "Южнопортовая"
                    ]
                  },
                  "outcoming_path_comment": "500 м прямо",
                  "turn_angle": 18,
                  "turn_direction": "keep_right",
                  "type": "crossroad"
                },
                {
                  "comment": "Разворот на ул. Южнопортовая",
                  "icon": "turn_over_right_hand",
                  "id": "14663624430473353017",
                  "outcoming_path": {
                    "distance": 1217,
                    "duration": 128,
                    "geometry": [
                      {
                        "color": "normal",
                        "length": 35,
                        "selection": "LINESTRING(37.681061 55.712084, 37.681164 55.711980, 37.681190 55.711964, 37.681226 55.711952, 37.681255 55.711951, 37.681286 55.711959, 37.681298 55.711969, 37.681302 55.711985, 37.681298 55.712003, 37.681278 55.712079)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 134,
                        "selection": "LINESTRING(37.681278 55.712079, 37.681153 55.712246, 37.680916 55.712562, 37.680439 55.713197)",
                        "style": "normal"
                      },
                      {
                        "color": "fast",
                        "length": 133,
                        "selection": "LINESTRING(37.680439 55.713197, 37.680072 55.713685, 37.679607 55.714305)",
                        "style": "bridge"
                      },
                      {
                        "color": "fast",
                        "length": 915,
                        "selection": "LINESTRING(37.679607 55.714305, 37.679512 55.714432, 37.679449 55.714515, 37.679332 55.714672, 37.679194 55.714856, 37.679147 55.714918, 37.679116 55.714959, 37.679042 55.715058, 37.678863 55.715297, 37.678538 55.715730, 37.678408 55.715903, 37.678373 55.715951, 37.678296 55.716080, 37.678280 55.716099, 37.677976 55.716468, 37.677741 55.716766, 37.677340 55.717299, 37.677132 55.717577, 37.677070 55.717663, 37.676931 55.717848, 37.676830 55.718003, 37.676584 55.718306, 37.675398 55.719884, 37.675385 55.719902, 37.675367 55.719946, 37.675328 55.720018, 37.674840 55.720708, 37.674830 55.720722, 37.674824 55.720731, 37.674808 55.720753, 37.674785 55.720785, 37.674754 55.720821, 37.674721 55.720854, 37.674697 55.720878, 37.674662 55.720905, 37.674641 55.720922, 37.674573 55.720966, 37.674548 55.720986, 37.674512 55.721034, 37.674499 55.721049, 37.674334 55.721261, 37.674251 55.721368, 37.674219 55.721402, 37.674180 55.721443, 37.674150 55.721472, 37.674122 55.721495, 37.674112 55.721502, 37.674102 55.721506, 37.673919 55.721734, 37.673734 55.721962)",
                        "style": "normal"
                      }
                    ],
                    "names": [
                      "Южнопортовая"
                    ]
                  },
                  "outcoming_path_comment": "1.2 км прямо",
                  "turn_angle": -180,
                  "turn_direction": "uturn_left",
                  "type": "crossroad"
                },
                {
                  "comment": "Поворот направо",
                  "icon": "crossroad_right",
                  "id": "2187364005063417839",
                  "outcoming_path": {
                    "distance": 105,
                    "duration": 25,
                    "geometry": [
                      {
                        "color": "ignore",
                        "length": 105,
                        "selection": "LINESTRING(37.673734 55.721962, 37.673858 55.721994, 37.674066 55.722048, 37.674175 55.722075, 37.675276 55.722359)",
                        "style": "normal"
                      }
                    ],
                    "names": []
                  },
                  "outcoming_path_comment": "100 м прямо",
                  "turn_angle": 90,
                  "turn_direction": "right",
                  "type": "crossroad"
                },
                {
                  "comment": "finish",
                  "icon": "finish",
                  "id": "1846082160187291156",
                  "outcoming_path_comment": "Вы на месте!",
                  "type": "end"
                }
              ],
              "reliability": 0,
              "route_id": "moscow-tax-back.m9/taxirouting/1759612047.382621",
              "total_distance": 58709,
              "total_duration": 2954,
              "type": "taxirouting",
              "ui_total_distance": {
                "unit": "км",
                "value": "59"
              },
              "ui_total_duration": "49 мин",
              "waypoints": [
                {
                  "original_point": {
                    "lat": 55.84464637610425,
                    "lon": 37.01030224483337
                  },
                  "projected_point": {
                    "lat": 55.84464637610425,
                    "lon": 37.01030224483337
                  },
                  "transit": false
                },
                {
                  "original_point": {
                    "lat": 55.72235975641408,
                    "lon": 37.67527681013629
                  },
                  "projected_point": {
                    "lat": 55.72235975641408,
                    "lon": 37.67527681013629
                  },
                  "transit": false
                }
              ]
            }
          }
        ],
        "description": "Финальный этап на велосипеде до метро"
      }
    ],
    "text": "✅ Многоэтапный маршрут построен!\n\n🔄 Этап 1: Первый этап на трамвае до парка\n   🚗 1 вариантов маршрута\n🔄 Этап 2: Пеший переход или общественный транспорт до места еды\n   🚗 1 вариантов маршрута\n🔄 Этап 3: Финальный этап на велосипеде до метро\n   🚗 1 вариантов маршрута",
    "success": true,
    "error_message": null
  }